{
    "ru": [
        {
            "ecode": "1203320000020002",
            "intro": "RFID-метка на AMS4 слот 3 повреждена."
        },
        {
            "ecode": "1201330000020002",
            "intro": "RFID-метка на AMS2 слот 4 повреждена."
        },
        {
            "ecode": "0701100000010001",
            "intro": "Двигатель AMS2 слот 1 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0300160000010001",
            "intro": "Датчик тока двигателя-E неисправен. Это может быть вызвано неисправностью аппаратной схемы выборки."
        },
        {
            "ecode": "0300110000020001",
            "intro": "Резонансная частота оси Y низкая. Возможно, ремень Грм ослаблен."
        },
        {
            "ecode": "03000A0000010001",
            "intro": "Датчик силы стола 1 слишком чувствителен. Возможно, он застрял между натяжным рычагом и опорой нагревательного стола или регулировочный винт затянут слишком сильно."
        },
        {
            "ecode": "1202130000010001",
            "intro": "Двигатель AMS3 слот 4 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200450000020003",
            "intro": "Ручка резака нити не освободилась. Ручка или лезвие могут застрять."
        },
        {
            "ecode": "1201220000020002",
            "intro": "Филамент в AMS2 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0500030000020013",
            "intro": "xcam дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0300930000010005",
            "intro": "Температура камеры ненормальная. Датчик температуры камерного нагревателя на входе воздуха может иметь короткое замыкание."
        },
        {
            "ecode": "0701110000020002",
            "intro": "Двигатель AMS2 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1203220000020002",
            "intro": "Филамент в AMS4 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0300010000010001",
            "intro": "Температура подогрева ненормальная; в нагревателе может быть короткое замыкание."
        },
        {
            "ecode": "0C00010000010003",
            "intro": "Синхронизация между камерой Micro Lidar и MCU ненормальна. Пожалуйста, перезагрузите принтер."
        },
        {
            "ecode": "0300900000010001",
            "intro": "Произошел сбой в нагреве камеры. Возможно, нагреватель камеры не подает горячий воздух."
        },
        {
            "ecode": "0703130000010003",
            "intro": "Управление крутящим моментом двигателя AMS4 слот 4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1202210000020003",
            "intro": "Филамент AMS3 слот 2 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0701300000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "0700110000010001",
            "intro": "Двигатель AMS1 слот 2 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1202220000020001",
            "intro": "Филамент в AMS3 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0700200000020004",
            "intro": "Филамент AMS1 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "1202330000020002",
            "intro": "RFID-метка на AMS3 слот 4 повреждена."
        },
        {
            "ecode": "1201200000020005",
            "intro": "Филамент AMS2 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700220000030001",
            "intro": "Филамент AMS1 слот 3 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1201230000020004",
            "intro": "Филамент AMS2 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "1200210000020003",
            "intro": "Филамент AMS1 слот 2 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0703200000020003",
            "intro": "Филамент AMS4 слот 1 может быть сломан в системе AMS."
        },
        {
            "ecode": "0500040000010003",
            "intro": "Содержимое файла печати нечитабельно. Пожалуйста, отправьте задание на печать еще раз."
        },
        {
            "ecode": "0700310000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1203210000020004",
            "intro": "Филамент AMS4 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "0500040000020018",
            "intro": "RFID-метка на AMS3 слот 1 не может быть идентифицирована."
        },
        {
            "ecode": "1200100000020002",
            "intro": "Двигатель AMS1 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0700110000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 2 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0701130000020002",
            "intro": "Двигатель AMS2 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1203110000010001",
            "intro": "Двигатель AMS4 слот 2 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0701010000010001",
            "intro": "Вспомогательный электродвигатель AMS2 вышел из строя. Возможно, экструзионное колесо изношено или филамент слишком тонкий."
        },
        {
            "ecode": "1200730000010001",
            "intro": "AMS1 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 4."
        },
        {
            "ecode": "0702200000030002",
            "intro": "Филамент AMS3 слот 1 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "1203310000010001",
            "intro": "Катушка RFID AMS4 слот 2 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "050003000001000A",
            "intro": "Состояние системы ненормальное; пожалуйста, восстановите заводские настройки."
        },
        {
            "ecode": "0701350000010001",
            "intro": "Датчик температуры и влажности имеет ошибку. Чип может быть неисправен."
        },
        {
            "ecode": "0300120000020001",
            "intro": "Передняя крышка печатной головы отвалилась."
        },
        {
            "ecode": "1203320000030003",
            "intro": "AMS4 слот 3 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0500020000020005",
            "intro": "Не удалось подключиться к Интернету; пожалуйста, проверьте сетевое соединение."
        },
        {
            "ecode": "050004000002001B",
            "intro": "RFID-метка на AMS3 слот 4 не может быть идентифицирована."
        },
        {
            "ecode": "0700350000010001",
            "intro": "Датчик температуры и влажности имеет ошибку. Чип может быть неисправен."
        },
        {
            "ecode": "1202830000020001",
            "intro": "Филамент в AMS3 слот 4 может запутаться или застрять."
        },
        {
            "ecode": "0701620000020001",
            "intro": "Слот 3 AMS2 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0300010000010003",
            "intro": "Температура подогрева ненормальная; нагреватель перегрелся."
        },
        {
            "ecode": "1201220000020004",
            "intro": "Филамент AMS2 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0701310000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "0700120000010001",
            "intro": "Двигатель AMS1 слот 3 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200130000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 4 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "1202500000020001",
            "intro": "Связь AMS3 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "030092000001000A",
            "intro": "Температура нагревателя камеры 2 ненормальна. Возможно, неисправна плата переменного тока."
        },
        {
            "ecode": "050004000002001D",
            "intro": "RFID-метка на AMS4 слот 2 не может быть идентифицирована."
        },
        {
            "ecode": "0703610000020001",
            "intro": "Слот 2 AMS4 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "1201500000020001",
            "intro": "Связь AMS2 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "1201230000020006",
            "intro": "Не удалось выдавить филамент AMS2 слот 4; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "1201200000020003",
            "intro": "Филамент AMS2 слот 1 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0300910000010007",
            "intro": "Температура нагревателя камеры 1 ненормальная. Датчик может иметь разрыв цепи."
        },
        {
            "ecode": "1203210000030001",
            "intro": "Филасент AMS4 слот 2 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "1201110000010001",
            "intro": "Двигатель AMS2 слот 2 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1203230000020003",
            "intro": "Филамент AMS4 слот 4 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0500040000020014",
            "intro": "RFID-метка на AMS2 слот 1 не может быть идентифицирована."
        },
        {
            "ecode": "0700210000030001",
            "intro": "Филамент AMS1 слот 2 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0701230000020005",
            "intro": "Филамент AMS2 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0C0003000001000A",
            "intro": "Ваш принтер находится в заводском режиме. Пожалуйста, свяжитесь со службой технической поддержки."
        },
        {
            "ecode": "0701210000020003",
            "intro": "Филамент AMS2 слот 2 может быть сломан в системе AMS."
        },
        {
            "ecode": "0701300000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0702010000010003",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS3 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0500040000020017",
            "intro": "RFID-метка на AMS2 слот 4 не может быть идентифицирована."
        },
        {
            "ecode": "1200450000020001",
            "intro": "Неисправен датчик обрезки филамента. Пожалуйста, проверьте, правильно ли подключен разъем."
        },
        {
            "ecode": "1202710000010001",
            "intro": "AMS3 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 2."
        },
        {
            "ecode": "1203210000020005",
            "intro": "Филамент AMS4 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1200230000020003",
            "intro": "Филамент AMS1 слот 4 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0702130000020002",
            "intro": "Двигатель AMS3 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0703350000010001",
            "intro": "Датчик температуры и влажности имеет ошибку. Чип может быть неисправен."
        },
        {
            "ecode": "0701230000030001",
            "intro": "Филамент AMS2 слот 4 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1203210000030002",
            "intro": "Филамент в AMS4 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "03001B0000010002",
            "intro": "На датчике силы теплового слоя было обнаружено внешнее воздействие. Возможно, сигнальный провод датчика не закреплен."
        },
        {
            "ecode": "03000D0000020001",
            "intro": "Неправильное возвращение стола в исходное положение: возможно, на столе имеется выпуклость или кончик сопла загрязнен."
        },
        {
            "ecode": "0703220000020002",
            "intro": "AMS4 Слот 3 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "12FF200000020001",
            "intro": "Закончился филамент в держателе катушки; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702110000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 2 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "03000F0000010001",
            "intro": "Данные акселерометра недоступны. Возможно, нарушено соединение связи с печатной головой или поврежден акселерометр."
        },
        {
            "ecode": "0700120000020002",
            "intro": "Двигатель AMS1 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1203130000010001",
            "intro": "Двигатель AMS4 слот 4 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1203120000020002",
            "intro": "Двигатель AMS4 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1200200000020005",
            "intro": "Филамент AMS1 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0C0003000003000D",
            "intro": "Возможно, упали какие-то предметы или экструдер не выдавливает нормально. Пожалуйста, проверьте и решите, следует ли остановить печать."
        },
        {
            "ecode": "0700210000020001",
            "intro": "Филамент в AMS1 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702100000010001",
            "intro": "Двигатель AMS3 слот 1 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0702320000020002",
            "intro": "RFID-метка на AMS3 слот 3 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1202800000020001",
            "intro": "Филамент в AMS3 слот 1 может запутаться или застрять."
        },
        {
            "ecode": "0700100000020002",
            "intro": "Двигатель AMS1 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0300200000010004",
            "intro": "Неправильное возвращение оси Y: возможно, ремень Грм ослаблен."
        },
        {
            "ecode": "0701010000010004",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS2 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "03000D0000010009",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "0500040000010001",
            "intro": "Не удалось загрузить задание на печать. Пожалуйста, проверьте ваше сетевое соединение."
        },
        {
            "ecode": "0701230000020002",
            "intro": "AMS2 Слот 4 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0300070000010003",
            "intro": "Сопротивление двигателя B ненормальное, возможно, двигатель вышел из строя."
        },
        {
            "ecode": "0300150000010001",
            "intro": "Датчик тока Motor-Z неисправен. Это может быть вызвано неисправностью аппаратной схемы выборки."
        },
        {
            "ecode": "1200220000020003",
            "intro": "Филамент AMS1 слот 3 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0300140000010001",
            "intro": "Датчик тока двигателя B неисправен. Это может быть вызвано неисправностью аппаратной схемы выборки."
        },
        {
            "ecode": "0300070000010002",
            "intro": "У двигателя B короткое замыкание. Возможно, он вышел из строя."
        },
        {
            "ecode": "0300020000010007",
            "intro": "Температура сопла ненормальная; датчик может иметь разрыв цепи."
        },
        {
            "ecode": "0700310000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0500020000020003",
            "intro": "Не удалось подключиться к Интернету; пожалуйста, проверьте сетевое соединение."
        },
        {
            "ecode": "0700100000010001",
            "intro": "Двигатель AMS1 слот 1 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1201210000020006",
            "intro": "Не удалось выдавить филамент AMS2 слот 2; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0C0001000001000A",
            "intro": "Светодиод Micro Lidar может быть сломан."
        },
        {
            "ecode": "1200130000020002",
            "intro": "Двигатель AMS1 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1200450000020002",
            "intro": "Расстояние резки резака для нити слишком велико. Двигатель X может потерять скорость."
        },
        {
            "ecode": "1202230000020001",
            "intro": "Филамент в AMS3 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200210000020004",
            "intro": "Филамент AMS1 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "1201320000010001",
            "intro": "Катушка RFID AMS2 слот 3 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1202100000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 1 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0703200000020002",
            "intro": "AMS4 Слот 1 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0703200000020005",
            "intro": "Филамент AMS4 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1201130000020002",
            "intro": "Двигатель AMS2 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "03000A0000010003",
            "intro": "Сигнал датчика силы стола 1 слишком слабый. Электронное соединение с датчиком может быть нарушено."
        },
        {
            "ecode": "1200250000020001",
            "intro": "Не удалось выдавить филамент, возможно, экструдер засорен."
        },
        {
            "ecode": "1200240000020001",
            "intro": "Филамент может быть сломан в печатной голове."
        },
        {
            "ecode": "0300200000010002",
            "intro": "Ненормальное возвращение оси Y в исходное положение: проверьте, не застряла ли печатная головка или не слишком ли сильно сопротивление каретки Y."
        },
        {
            "ecode": "03000B0000010005",
            "intro": "Датчик усилия 2 обнаружил неожиданное непрерывное усилие. Возможно, нагревательный элемент застрял или аналоговая передняя панель сломана."
        },
        {
            "ecode": "1202100000010001",
            "intro": "Двигатель AMS3 слот 1 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0703310000010001",
            "intro": "Плата RFID между AMS4 слот 3 и слот 4 имеет ошибку."
        },
        {
            "ecode": "0300920000010007",
            "intro": "Температура нагревателя камеры 2 ненормальная. Датчик может иметь разрыв цепи."
        },
        {
            "ecode": "0500040000030008",
            "intro": "Дверь обнаружена открытой."
        },
        {
            "ecode": "1200330000030003",
            "intro": "AMS1 слот 4 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0500030000020010",
            "intro": "дамп ядра, он восстанавливается."
        },
        {
            "ecode": "1202200000020006",
            "intro": "Не удалось выдавить филамент AMS3 слот 1; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0300900000010010",
            "intro": "Неисправна связь с регулятором температуры камеры."
        },
        {
            "ecode": "1201220000030002",
            "intro": "Филамент в AMS2 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200230000030002",
            "intro": "Филамент в AMS1 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201300000030003",
            "intro": "AMS2 слот 1 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0300090000010003",
            "intro": "Сопротивление двигателя-E ненормальное, возможно, двигатель вышел из строя."
        },
        {
            "ecode": "1201210000020005",
            "intro": "Филамент AMS2 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700320000020002",
            "intro": "RFID-метка на AMS1 слот 3 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "0700020000010001",
            "intro": "AMS1 Ошибка скорости и длины нити: возможно, одометрия нити неисправна."
        },
        {
            "ecode": "0702210000020003",
            "intro": "Филамент AMS3 слот 2 может быть сломан в системе AMS."
        },
        {
            "ecode": "0C00010000010009",
            "intro": "Объектив камеры Micro Lidar загрязнен. Пожалуйста, очистите линзу."
        },
        {
            "ecode": "1200220000030001",
            "intro": "Филасент AMS1 слот 3 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0701200000030002",
            "intro": "Филамент AMS2 слот 1 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0702230000020003",
            "intro": "Филамент AMS3 слот 4 может быть сломан в системе AMS."
        },
        {
            "ecode": "1203320000010001",
            "intro": "Катушка RFID AMS4 слот 3 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0300090000010001",
            "intro": "Двигатель-Е имеет обрыв. Соединение может быть ослаблено или двигатель вышел из строя."
        },
        {
            "ecode": "1200230000030001",
            "intro": "Филасент AMS1 слот 4 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "1202320000020002",
            "intro": "RFID-метка на AMS3 слот 3 повреждена."
        },
        {
            "ecode": "1200230000020006",
            "intro": "Не удалось выдавить филамент AMS1 слот 4; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0701230000020003",
            "intro": "Филамент AMS2 слот 4 может быть сломан в системе AMS."
        },
        {
            "ecode": "03001A0000020002",
            "intro": "Сопло забито филаментом."
        },
        {
            "ecode": "1203210000020002",
            "intro": "Филамент в AMS4 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702220000020001",
            "intro": "Филамент в AMS3 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201120000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 3 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0300080000010001",
            "intro": "Двигатель-Z имеет обрыв цепи. Соединение может быть ослаблено или двигатель вышел из строя."
        },
        {
            "ecode": "1201200000020006",
            "intro": "Не удалось выдавить филамент AMS2 слот 1; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0703230000030001",
            "intro": "Филамент AMS4 слот 4 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0701120000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 3 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1200200000020001",
            "intro": "Филамент в AMS1 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203330000020002",
            "intro": "RFID-метка на AMS4 слот 4 повреждена."
        },
        {
            "ecode": "0500020000020004",
            "intro": "Неавторизованный пользователь: проверьте информацию своей учетной записи."
        },
        {
            "ecode": "0500040000020016",
            "intro": "RFID-метка на AMS2 слот 3 не может быть идентифицирована."
        },
        {
            "ecode": "1201210000020001",
            "intro": "Филамент в AMS2 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203230000020002",
            "intro": "Филамент в AMS4 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203220000020003",
            "intro": "Филамент AMS4 слот 3 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0300190000010001",
            "intro": "Датчик токов по оси Y недоступен, провод может быть оборван."
        },
        {
            "ecode": "0300180000010003",
            "intro": "Датчик силы экструзии недоступен, возможно, нарушена связь между MC и TH или сломан датчик."
        },
        {
            "ecode": "1202220000020003",
            "intro": "Филамент AMS3 слот 3 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0700220000020002",
            "intro": "AMS1 Слот 3 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0700400000020004",
            "intro": "Сигнал буфера филамента ненормальный; пружина может застрять или филамент может запутаться."
        },
        {
            "ecode": "1200220000020006",
            "intro": "Не удалось выдавить филамент AMS1 слот 3; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "03000B0000010004",
            "intro": "Датчиком усилия 2 было обнаружено внешнее возмущение. Возможно, пластина нагревательного слоя коснулась чего-то снаружи нагревательного слоя."
        },
        {
            "ecode": "0300100000020001",
            "intro": "Резонансная частота оси X низкая. Ремень Грм может ослабнуть."
        },
        {
            "ecode": "1000010000020001",
            "intro": "Температура стола превышает температуру застывания филамента. Пожалуйста, откройте переднюю дверцу принтера перед печатью, чтобы избежать засорения сопла."
        },
        {
            "ecode": "0300080000010003",
            "intro": "Сопротивление двигателя Z ненормальное, возможно, двигатель вышел из строя."
        },
        {
            "ecode": "1203200000020003",
            "intro": "Филамент AMS4 слот 1 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "1200100000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 1 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "1201800000020001",
            "intro": "Филамент в AMS2 слот 1 может запутаться или застрять."
        },
        {
            "ecode": "0300190000020002",
            "intro": "Чувствительность датчика токов по оси Y слишком низкок."
        },
        {
            "ecode": "1201110000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 2 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "1200200000020006",
            "intro": "Не удалось выдавить филамент AMS1 слот 1; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0701310000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0701200000020005",
            "intro": "Филамент AMS2 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0703200000030002",
            "intro": "Филамент AMS4 слот 1 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0300940000020003",
            "intro": "Не удалось достичь желаемой температуры в камере. Принтер остановится, ожидая достижения температуры в камере."
        },
        {
            "ecode": "0300910000010003",
            "intro": "Температура нагревателя камеры 1 ненормальная. Нагреватель перегрелся."
        },
        {
            "ecode": "0701200000030001",
            "intro": "Филамент AMS2 слот 1 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1202300000030003",
            "intro": "AMS3 слот 1 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1200220000020001",
            "intro": "Филамент в AMS1 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0300180000010001",
            "intro": "Значение датчика силы экструзии невелико. Похоже, что сопло не установлено."
        },
        {
            "ecode": "1000010000020003",
            "intro": "Замедленная запись может повлиять на качество печати, пожалуйста, подтвердите, включена ли она."
        },
        {
            "ecode": "0C00010000010005",
            "intro": "Параметр OTP камеры Micro Lidar ненормальный. Пожалуйста, свяжитесь со службой послепродажного обслуживания."
        },
        {
            "ecode": "1201230000020003",
            "intro": "Филамент AMS2 слот 4 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0C0003000002000F",
            "intro": "Пропущенна проверка первого слоя, проверка не будет поддерживаться для текущей печати."
        },
        {
            "ecode": "1201730000010001",
            "intro": "AMS2 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 4."
        },
        {
            "ecode": "07FF200000020002",
            "intro": "Внешняя филамент отсутствует; пожалуйста, загрузите филамент."
        },
        {
            "ecode": "0700210000020005",
            "intro": "Филамент AMS1 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700330000020002",
            "intro": "RFID-метка на AMS1 слот 4 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "0700610000020001",
            "intro": "Слот 1 AMS2 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0703230000020002",
            "intro": "AMS4 Слот 4 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0701120000020002",
            "intro": "Двигатель AMS2 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1203200000020001",
            "intro": "Филамент в AMS4 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201210000020004",
            "intro": "Филамент AMS2 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "1201210000020002",
            "intro": "Филамент в AMS2 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703320000020002",
            "intro": "RFID-метка на AMS4 слот 3 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1201230000030001",
            "intro": "Филасент AMS2 слот 4 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0701600000020001",
            "intro": "Слот 1 AMS2 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "1200230000020004",
            "intro": "Филамент AMS1 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "0702350000010001",
            "intro": "Датчик температуры и влажности имеет ошибку. Чип может быть неисправен."
        },
        {
            "ecode": "07FF200000020001",
            "intro": "Внешнний филамент закончился; пожалуйста, загрузите новый."
        },
        {
            "ecode": "0300930000010001",
            "intro": "Температура в камере ненормальная. Возможно, произошло короткое замыкание датчика температуры нагревателя камеры."
        },
        {
            "ecode": "0500020000020001",
            "intro": "Не удалось подключиться к Интернету; пожалуйста, проверьте сетевое соединение."
        },
        {
            "ecode": "03000B0000010002",
            "intro": "Сигнал датчика силы нагрева 2 слабый. Датчик силы может быть неисправен или иметь плохое электрическое подключение."
        },
        {
            "ecode": "1203230000020006",
            "intro": "Не удалось выдавить филамент AMS4 слот 4; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0700200000020003",
            "intro": "Филамент AMS1 слот 1 может быть сломан в системе AMS."
        },
        {
            "ecode": "0700450000020001",
            "intro": "Датчик обрезки филамента неисправен; пожалуйста, проверьте, правильно ли подключен разъем."
        },
        {
            "ecode": "050003000002000C",
            "intro": "Ошибка модуля беспроводной сети: выключите/включите Wi-Fi или перезагрузите устройство."
        },
        {
            "ecode": "0700200000020002",
            "intro": "AMS1 Слот 1 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0703020000010001",
            "intro": "AMS4 Ошибка скорости и длины нити: возможно, одометрия нити неисправна."
        },
        {
            "ecode": "0300010000010007",
            "intro": "Температура подогрева ненормальная; датчик может иметь разрыв цепи."
        },
        {
            "ecode": "1203110000020002",
            "intro": "Двигатель AMS4 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0700400000020002",
            "intro": "Ошибка сигнала положения буфера филамента: возможно, неисправен датчик положения."
        },
        {
            "ecode": "0300020000010001",
            "intro": "Температура сопла ненормальная; в нагревателе может быть короткое замыкание."
        },
        {
            "ecode": "0300930000010004",
            "intro": "Температура камеры ненормальная. Датчик температуры камерного нагревателя на выходе воздуха может иметь разрыв цепи."
        },
        {
            "ecode": "0700130000010001",
            "intro": "Двигатель AMS1 слот 4 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0C00020000010001",
            "intro": "Горизонтальный лазер не горит. Пожалуйста, проверьте, соединение или то что может закрыывать обзор лазеру."
        },
        {
            "ecode": "0300930000010003",
            "intro": "Температура камеры ненормальная. Датчик температуры камерного нагревателя на выходе воздуха может иметь короткое замыкание."
        },
        {
            "ecode": "0300910000010006",
            "intro": "Температура нагревателя камеры 1 ненормальная. Датчик может иметь короткое замыкание."
        },
        {
            "ecode": "0701230000020004",
            "intro": "Филамент AMS2 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "1201820000020001",
            "intro": "Филамент в AMS2 слот 3 может запутаться или застрять."
        },
        {
            "ecode": "1200200000030002",
            "intro": "Филамент в AMS1 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1202720000010001",
            "intro": "AMS3 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 3."
        },
        {
            "ecode": "0500030000020014",
            "intro": "bbl_screen дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0500040000010004",
            "intro": "Файл печати неавторизован."
        },
        {
            "ecode": "1202310000030003",
            "intro": "AMS3 слот 2 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0703110000010003",
            "intro": "Управление крутящим моментом двигателя слота 2 AMS4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1203220000020001",
            "intro": "Филамент в AMS4 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201230000020005",
            "intro": "Филамент AMS2 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0500030000010003",
            "intro": "Модуль AMS неисправен. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "0702220000020003",
            "intro": "Филамент AMS3 слот 3 может быть сломан в системе AMS."
        },
        {
            "ecode": "1202210000020004",
            "intro": "Филамент AMS3 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "1201700000010001",
            "intro": "AMS2 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 1."
        },
        {
            "ecode": "0500020000020007",
            "intro": "Не удалось войти в службу Liveview; пожалуйста, проверьте ваше сетевое соединение."
        },
        {
            "ecode": "0300900000010003",
            "intro": "Произошел сбой в нагреве камеры. Возможно, температура источника питания слишком высока."
        },
        {
            "ecode": "0701220000020004",
            "intro": "Филамент AMS2 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0C0003000002000C",
            "intro": "Маркер локализации рабочего стола не обнаружен. Пожалуйста, проверьте, правильно ли выровнена рабочая пластина."
        },
        {
            "ecode": "1202300000010004",
            "intro": "RFID не может быть прочитан из-за сбоя чипа шифрования в AMS3."
        },
        {
            "ecode": "03000C0000010004",
            "intro": "На датчике силы 3 было обнаружено внешнее возмущение. Возможно, пластина нагревательного слоя коснулась чего-то снаружи нагревательного слоя."
        },
        {
            "ecode": "0701010000020002",
            "intro": "Вспомогательный электродвигатель AMS2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1202220000020005",
            "intro": "Филамент AMS3 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1201810000020001",
            "intro": "Филамент в AMS2 слот 2 может запутаться или застрять."
        },
        {
            "ecode": "1203120000010001",
            "intro": "Двигатель AMS4 слот 3 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0500010000020003",
            "intro": "Не работает USB-камера."
        },
        {
            "ecode": "0500030000030007",
            "intro": "Произошла системная ошибка. Автоматическим перезапуском был восстановлен."
        },
        {
            "ecode": "1202320000030003",
            "intro": "AMS3 слот 3 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0500030000020017",
            "intro": "recorder дамп ядра, он восстанавливается."
        },
        {
            "ecode": "1000010000020002",
            "intro": "Твердость сопла, требуемая для филамента, выше, чем твердость сопла принтера по умолчанию. Пожалуйста, замените закаленное сопло или филамент, в противном случае сопло будет изношено или повреждено."
        },
        {
            "ecode": "0C00010000020006",
            "intro": "Внешние параметры камеры микролидара ненормальны. Пожалуйста, включите калибровку расхода при следующей печати."
        },
        {
            "ecode": "1203820000020001",
            "intro": "Филамент в AMS4 слот 3 может запутаться или застрять."
        },
        {
            "ecode": "0C00020000020006",
            "intro": "Высота сопла кажется слишком высокой. Пожалуйста, проверьте, не прилипли ли к соплу остатки филамента."
        },
        {
            "ecode": "0500030000020015",
            "intro": "device_gate дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0703200000020004",
            "intro": "Филамент AMS4 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0701110000010001",
            "intro": "Двигатель AMS2 слот 2 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0C00010000010001",
            "intro": "Камера Micro Lidar отключена. Пожалуйста, проверьте подключение оборудования."
        },
        {
            "ecode": "0300040000020001",
            "intro": "Скорость вентилятора сопла слишком низкая или остановлена. Возможно, он застрял или разъем подключен неправильно."
        },
        {
            "ecode": "1200110000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 2 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "1200310000010001",
            "intro": "Катушка RFID AMS1 слот 2 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1202730000010001",
            "intro": "AMS3 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 4."
        },
        {
            "ecode": "0700450000020003",
            "intro": "Ручка резака нити не освободилась. Ручка или лезвие могут застрять."
        },
        {
            "ecode": "1201130000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 4 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0500030000010005",
            "intro": "Внутренняя служба работает со сбоями. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "0702310000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0703330000020002",
            "intro": "RFID-метка на AMS4 слот 4 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "0703210000020003",
            "intro": "Филамент AMS4 слот 2 может быть сломан в системе AMS."
        },
        {
            "ecode": "0703010000010001",
            "intro": "Вспомогательный электродвигатель AMS4 вышел из строя. Возможно, экструзионное колесо изношено или филамент слишком тонкий."
        },
        {
            "ecode": "1203330000030003",
            "intro": "AMS4 слот 4 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0700500000020001",
            "intro": "Связь AMS1 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "0702230000020004",
            "intro": "Филамент AMS3 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "0300100000020002",
            "intro": "Резонансная частота оси X сильно отличается от последней калибровки. Пожалуйста, очистите карбоновые стержени и после этого повторите калибровку машины."
        },
        {
            "ecode": "0703300000020002",
            "intro": "RFID-метка на AMS4 слот 1 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1201220000020001",
            "intro": "Филамент в AMS2 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703100000010001",
            "intro": "Двигатель AMS4 слот 1 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200210000030002",
            "intro": "Филамент в AMS1 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0700300000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0702120000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 3 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1200310000020002",
            "intro": "RFID-метка на AMS1 слот 2 повреждена."
        },
        {
            "ecode": "1202200000020004",
            "intro": "Филамент AMS3 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0500040000020012",
            "intro": "RFID-метка на AMS1 слот 3 не может быть идентифицирована."
        },
        {
            "ecode": "0300180000010002",
            "intro": "Чувствительность датчика силы выдавливания является низкой, сопло может быть некорректно установлено."
        },
        {
            "ecode": "1202210000020001",
            "intro": "Филамент в AMS3 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0701010000010003",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS2 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0702610000020001",
            "intro": "Слот 2 AMS3 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0703010000010004",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS4 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0500040000020019",
            "intro": "RFID-метка на AMS3 слот 2 не может быть идентифицирована."
        },
        {
            "ecode": "0300110000020002",
            "intro": "Резонансная частота оси Y сильно отличается от последней калибровки. Пожалуйста, очистите карбоновые стержени и после этого повторите калибровку машины."
        },
        {
            "ecode": "1201120000020002",
            "intro": "Двигатель AMS2 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0C00030000020002",
            "intro": "Проверка первого слоя прекращена из-за аномальных данных лидара."
        },
        {
            "ecode": "0700300000010001",
            "intro": "Плата RFID между AMS1 слот 1 и слот 2 имеет ошибку."
        },
        {
            "ecode": "03000A0000010004",
            "intro": "На датчике усилия 1 было обнаружено внешнее возмущение. Возможно, пластина нагревательного слоя коснулась чего-то снаружи нагревательного слоя."
        },
        {
            "ecode": "0500050000030002",
            "intro": "Устройство находится в инженерном состоянии, обратите внимание на вопросы информационной безопасности."
        },
        {
            "ecode": "0300180000020002",
            "intro": "Чувствительность датчика силы выдавливания является низкой, сопло может быть некорректно установлено."
        },
        {
            "ecode": "0500010000030004",
            "intro": "Недостаточно места на карте MicroSD. Очистите немного места."
        },
        {
            "ecode": "0700100000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 1 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0703500000020001",
            "intro": "Связь AMS4 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "0702120000020002",
            "intro": "Двигатель AMS3 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0700630000020001",
            "intro": "Слот 4 AMS1 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0700110000020002",
            "intro": "Двигатель AMS1 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0701230000020001",
            "intro": "Филамент в AMS2 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703220000020003",
            "intro": "Филамент AMS4 слот 3 может быть сломан в системе AMS."
        },
        {
            "ecode": "0500030000010006",
            "intro": "Произошел системный сбой. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "0700400000020003",
            "intro": "Связь с AMS Hub нарушена, возможно, кабель плохо подсоединен."
        },
        {
            "ecode": "1201300000020002",
            "intro": "RFID-метка на AMS2 слот 1 повреждена."
        },
        {
            "ecode": "0701110000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 2 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1202230000020005",
            "intro": "Филамент AMS3 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203210000020003",
            "intro": "Филамент AMS4 слот 2 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0300920000010008",
            "intro": "Камерный нагреватель 2 не смог достичь заданной температуры."
        },
        {
            "ecode": "0703210000030002",
            "intro": "Филамент AMS4 слот 2 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0702210000020004",
            "intro": "Филамент AMS3 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "0500050000010001",
            "intro": "Заводские данные платы AP являются ненормальными, пожалуйста, замените плату AP на новую."
        },
        {
            "ecode": "1201310000010001",
            "intro": "Катушка RFID AMS2 слот 2 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0703220000030002",
            "intro": "Филамент AMS4 слот 3 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0C00030000010009",
            "intro": "Модуль проверки первого уровня перезагрузился ненормально. Результат проверки может быть неточным."
        },
        {
            "ecode": "03000B0000010003",
            "intro": "Сигнал датчика силы нагрева 2 слишком слабый. Возможно, нарушено электронное подключение к датчику."
        },
        {
            "ecode": "0500040000010002",
            "intro": "Не удалось сообщить о состоянии печати. Пожалуйста, проверьте ваше сетевое соединение."
        },
        {
            "ecode": "1202230000020003",
            "intro": "Филамент AMS3 слот 4 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "030091000001000A",
            "intro": "Температура нагревателя камеры 1 ненормальна. Возможно, неисправна плата переменного тока."
        },
        {
            "ecode": "0C00030000030006",
            "intro": "Очищенный филамент мог скопиться в желобе для излишков. Пожалуйста, проверьте и очистите желоб."
        },
        {
            "ecode": "0701330000020002",
            "intro": "RFID-метка на AMS2 слот 4 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1201220000020005",
            "intro": "Филамент AMS2 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0701210000020004",
            "intro": "Филамент AMS2 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "1201220000020003",
            "intro": "Филамент AMS2 слот 3 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0702330000020002",
            "intro": "RFID-метка на AMS3 слот 4 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1202120000020002",
            "intro": "Двигатель AMS3 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0500030000020018",
            "intro": "security дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0701210000020002",
            "intro": "AMS2 Слот 2 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "03000D0000010005",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "0700220000020003",
            "intro": "Филамент AMS1 слот 3 может быть сломан в системе AMS."
        },
        {
            "ecode": "0300920000010002",
            "intro": "Температура нагревателя камеры 2 ненормальная. Возможно, в нагревателе имеется разрыв цепи или сработал термопредохранитель."
        },
        {
            "ecode": "050004000002001E",
            "intro": "RFID-метка на AMS4 слот 3 не может быть идентифицирована."
        },
        {
            "ecode": "0500040000010006",
            "intro": "Не удалось возобновить предыдущую печать."
        },
        {
            "ecode": "0701220000020002",
            "intro": "AMS2 Слот 3 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0703130000020002",
            "intro": "Двигатель AMS4 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1200320000030003",
            "intro": "AMS1 слот 3 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1200300000010004",
            "intro": "RFID не может быть прочитан из-за сбоя чипа шифрования в AMS1."
        },
        {
            "ecode": "0702210000020001",
            "intro": "Филамент в AMS3 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "050003000002000D",
            "intro": "SD-карта не работает."
        },
        {
            "ecode": "1201710000010001",
            "intro": "AMS2 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 2."
        },
        {
            "ecode": "1202120000010001",
            "intro": "Двигатель AMS3 слот 3 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1202200000030002",
            "intro": "Филамент в AMS3 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0300920000010003",
            "intro": "Температура нагревателя камеры 2 ненормальная. Нагреватель перегрелся."
        },
        {
            "ecode": "0700200000030001",
            "intro": "Филамент AMS1 слот 1 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0700010000010001",
            "intro": "Вспомогательный электродвигатель AMS1 вышел из строя. Возможно, экструзионное колесо изношено или филамент слишком тонкий."
        },
        {
            "ecode": "1201220000030001",
            "intro": "Филасент AMS2 слот 3 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0700010000010004",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS1 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1202810000020001",
            "intro": "Филамент в AMS3 слот 2 может запутаться или застрять."
        },
        {
            "ecode": "0700210000030002",
            "intro": "Филамент AMS1 слот 2 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0703220000020004",
            "intro": "Филамент AMS4 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0300060000010003",
            "intro": "Сопротивление двигателя А ненормальное, возможно, двигатель вышел из строя."
        },
        {
            "ecode": "0701210000020001",
            "intro": "Филамент в AMS2 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1202700000010001",
            "intro": "AMS3 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 1."
        },
        {
            "ecode": "0703600000020001",
            "intro": "Слот 1 AMS4 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "1200200000020002",
            "intro": "Филамент в AMS1 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203130000010003",
            "intro": "Управление крутящим моментом двигателя AMS4 слот 4 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0300070000010001",
            "intro": "Двигатель-B имеет обрыв цепи. Соединение может быть ослаблено или двигатель вышел из строя."
        },
        {
            "ecode": "1201330000030003",
            "intro": "AMS2 слот 4 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1202110000010001",
            "intro": "Двигатель AMS3 слот 2 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "12FF200000020004",
            "intro": "Пожалуйста, вытащите филамент держателя катушки из экструдера."
        },
        {
            "ecode": "1203220000020006",
            "intro": "Не удалось выдавить филамент AMS4 слот 3; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "1203330000010001",
            "intro": "Катушка RFID AMS4 слот 4 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0500030000010004",
            "intro": "Неисправен модуль AHB. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "0300930000010006",
            "intro": "Температура камеры ненормальная. Датчик температуры камерного нагревателя на входе воздуха может иметь разрыв цепи."
        },
        {
            "ecode": "0300010000010002",
            "intro": "Температура подогрева ненормальная; нагреватель может иметь разрыв цепи или термовыключатель может быть разомкнут."
        },
        {
            "ecode": "0700310000010001",
            "intro": "Плата RFID между AMS1 слот 3 и слот 4 имеет ошибку."
        },
        {
            "ecode": "0701310000010001",
            "intro": "Плата RFID между AMS2 слот 3 и слот 4 имеет ошибку."
        },
        {
            "ecode": "0500030000010009",
            "intro": "Произошло зависание системы. Он был восстановлен при автоматическом перезапуске."
        },
        {
            "ecode": "03001A0000020001",
            "intro": "Сопло покрыто филаментом или рабочая пластина установлена ​​криво."
        },
        {
            "ecode": "050003000001000B",
            "intro": "Экран неисправен; пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "1201310000030003",
            "intro": "AMS2 слот 2 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "12FF800000020001",
            "intro": "Филамент на держателе катушки может запутаться или застрять."
        },
        {
            "ecode": "1201310000020002",
            "intro": "RFID-метка на AMS2 слот 2 повреждена."
        },
        {
            "ecode": "1202200000020005",
            "intro": "Филамент AMS3 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1200230000020005",
            "intro": "Филамент AMS1 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0701130000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0C00020000020008",
            "intro": "Вертикальная лазерная линия слишком широкая. Пожалуйста, проверьте, не загрязнен ли нагревательный слой."
        },
        {
            "ecode": "0300170000020002",
            "intro": "Скорость вращения вентилятора сопла низкая. Возможно, он застрял и нуждается в очистке."
        },
        {
            "ecode": "0702500000020001",
            "intro": "Связь AMS3 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "0300410000010001",
            "intro": "Напряжение системы нестабильно; запуск функции защиты от сбоя питания."
        },
        {
            "ecode": "1200330000020002",
            "intro": "RFID-метка на AMS1 слот 4 повреждена."
        },
        {
            "ecode": "1202310000020002",
            "intro": "RFID-метка на AMS3 слот 2 повреждена."
        },
        {
            "ecode": "0703010000010003",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS4 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "050004000002001F",
            "intro": "RFID-метка на AMS4 слот 4 не может быть идентифицирована."
        },
        {
            "ecode": "0500030000010008",
            "intro": "Произошло зависание системы. Пожалуйста, перезапустите устройство."
        },
        {
            "ecode": "1200220000020002",
            "intro": "Филамент в AMS1 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0701220000020005",
            "intro": "Филамент AMS2 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203200000030001",
            "intro": "Филасент AMS4 слот 1 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0500030000020016",
            "intro": "device_manager дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0300200000010001",
            "intro": "Ненормальное возвращение оси X: проверьте, не застряла ли печатная голова или не имеет ли карбоновый стержень слишком большое сопротивление."
        },
        {
            "ecode": "1203220000020005",
            "intro": "Филамент AMS4 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0701500000020001",
            "intro": "Связь AMS2 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "0703230000020004",
            "intro": "Филамент AMS4 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "1203300000010004",
            "intro": "RFID не может быть прочитан из-за сбоя чипа шифрования в AMS4."
        },
        {
            "ecode": "0702230000030001",
            "intro": "Филамент AMS3 слот 4 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0702310000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1203300000020002",
            "intro": "RFID-метка на AMS4 слот 1 повреждена."
        },
        {
            "ecode": "0702310000010001",
            "intro": "Плата RFID между AMS3 слот 3 и слот 4 имеет ошибку."
        },
        {
            "ecode": "1200820000020001",
            "intro": "Филамент в AMS1 слот 3 может запутаться или застрять."
        },
        {
            "ecode": "0701120000010001",
            "intro": "Двигатель AMS2 слот 3 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0700010000010003",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS1 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0701300000010001",
            "intro": "Плата RFID между AMS2 слот 1 и слот 2 имеет ошибку."
        },
        {
            "ecode": "1201210000030002",
            "intro": "Филамент в AMS2 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201100000020002",
            "intro": "Двигатель AMS2 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1202220000030002",
            "intro": "Филамент в AMS3 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703220000030001",
            "intro": "Филамент AMS4 слот 3 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1202200000020001",
            "intro": "Филамент в AMS3 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0C00020000020003",
            "intro": "Горизонтальный лазер недостаточно ярок в исходной позиции. Пожалуйста, очистите или замените, если это сообщение появляется повторно."
        },
        {
            "ecode": "0700120000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 3 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1203210000020006",
            "intro": "Не удалось выдавить филамент AMS4 слот 2; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "1200200000030001",
            "intro": "Филасент AMS1 слот 1 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0700230000020001",
            "intro": "Филамент в AMS1 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703310000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1202130000020002",
            "intro": "Двигатель AMS3 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0702220000020004",
            "intro": "Филамент AMS3 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0700200000020001",
            "intro": "Филамент в AMS1 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0701020000010001",
            "intro": "AMS2 Ошибка скорости и длины нити: возможно, одометрия нити неисправна."
        },
        {
            "ecode": "0500010000020001",
            "intro": "Сбой в работе конвейера передачи данных."
        },
        {
            "ecode": "0500030000010002",
            "intro": "Неисправна печатная голова. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "0702130000010001",
            "intro": "Двигатель AMS3 слот 4 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0C00020000020002",
            "intro": "Горизонтальная лазерная линия слишком широкая. Пожалуйста, проверьте, не загрязнен ли стол."
        },
        {
            "ecode": "1200220000020004",
            "intro": "Филамент AMS1 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0701230000030002",
            "intro": "Филамент AMS2 слот 4 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0703120000010003",
            "intro": "Управление крутящим моментом двигателя слота 3 AMS4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0700230000030002",
            "intro": "Филамент AMS1 слот 4 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "1200230000020002",
            "intro": "Филамент в AMS1 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0701200000020001",
            "intro": "Филамент в AMS2 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0700230000020005",
            "intro": "Филамент AMS1 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203830000020001",
            "intro": "Филамент в AMS4 слот 4 может запутаться или застрять."
        },
        {
            "ecode": "0300130000010001",
            "intro": "Датчик тока двигателя-А неисправен. Это может быть вызвано неисправностью аппаратной схемы выборки."
        },
        {
            "ecode": "0703210000020002",
            "intro": "AMS4 Слот 2 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "1203230000020004",
            "intro": "Филамент AMS4 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "1202330000030003",
            "intro": "AMS3 слот 4 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1200220000030002",
            "intro": "Филамент в AMS1 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1202300000020002",
            "intro": "RFID-метка на AMS3 слот 1 повреждена."
        },
        {
            "ecode": "1200110000010001",
            "intro": "Двигатель AMS1 слот 2 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1201100000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 1 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0703220000020005",
            "intro": "Филамент AMS4 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203200000020004",
            "intro": "Филамент AMS4 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0701220000030001",
            "intro": "Филамент AMS2 слот 3 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0300020000010002",
            "intro": "Температура сопла ненормальная; нагреватель может иметь обрыв цепи."
        },
        {
            "ecode": "03000A0000010002",
            "intro": "Сигнал датчика силы стола 1 слабый. Датчик силы может быть сломан или иметь плохое электрическое соединение."
        },
        {
            "ecode": "03000D0000010002",
            "intro": "Сбой слоя. Вибрация окружающей среды слишком велика."
        },
        {
            "ecode": "0700310000020002",
            "intro": "RFID-метка на AMS1 слот 2 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "0701630000020001",
            "intro": "Слот 4 AMS2 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "1201720000010001",
            "intro": "AMS3 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 3."
        },
        {
            "ecode": "03000A0000010005",
            "intro": "Датчик усилия 1 обнаружил неожиданное непрерывное усилие. Возможно, нагревательный элемент застрял или аналоговая передняя часть сломана."
        },
        {
            "ecode": "1203100000020002",
            "intro": "Двигатель AMS4 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1203130000020002",
            "intro": "Двигатель AMS4 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0702200000030001",
            "intro": "Филамент AMS3 слот 1 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1202230000030002",
            "intro": "Филамент в AMS3 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200330000010001",
            "intro": "Катушка RFID AMS1 слот 4 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1200310000030003",
            "intro": "AMS1 слот 2 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0700130000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1203300000010001",
            "intro": "Катушка RFID AMS4 слот 1 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "03000D0000010003",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "1201320000030003",
            "intro": "AMS2 слот 3 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1203200000020002",
            "intro": "Филамент в AMS4 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0701310000020002",
            "intro": "RFID-метка на AMS2 слот 2 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1200800000020001",
            "intro": "Филамент в AMS1 слот 1 может запутаться или застрять."
        },
        {
            "ecode": "0300910000010008",
            "intro": "Нагреватель камеры 1 не смог достичь заданной температуры."
        },
        {
            "ecode": "03000D0000010006",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "0701320000020002",
            "intro": "RFID-метка на AMS2 слот 3 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1202210000020002",
            "intro": "Филамент в AMS3 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703300000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1203310000030003",
            "intro": "AMS4 слот 2 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "0300900000010005",
            "intro": "Не удалось прогреть камеру. Слишком высокое тепловое сопротивление."
        },
        {
            "ecode": "0700510000030001",
            "intro": "AMS отключен; пожалуйста, загрузите филамент из держателя катушки."
        },
        {
            "ecode": "0702130000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0500030000010001",
            "intro": "Модуль MC неисправен; пожалуйста, перезагрузите устройство или проверьте подключение кабеля устройства."
        },
        {
            "ecode": "1202210000020005",
            "intro": "Филамент AMS3 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700220000020001",
            "intro": "Филамент в AMS1 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702620000020001",
            "intro": "Слот 3 AMS3 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0702220000030002",
            "intro": "Филамент AMS3 слот 3 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0500020000020006",
            "intro": "Служба Liveview работает со сбоями; пожалуйста, проверьте ваше сетевое соединение."
        },
        {
            "ecode": "1201210000030001",
            "intro": "Филасент AMS2 слот 2 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "12FF200000020005",
            "intro": "Филамент может быть сломан в печатной голове."
        },
        {
            "ecode": "0702200000020003",
            "intro": "Филамент AMS3 слот 1 может быть сломан в системе AMS."
        },
        {
            "ecode": "1203310000020002",
            "intro": "RFID-метка на AMS4 слот 2 повреждена."
        },
        {
            "ecode": "050004000002001C",
            "intro": "RFID-метка на AMS4 слот 1 не может быть идентифицирована."
        },
        {
            "ecode": "1201210000020003",
            "intro": "Филамент AMS2 слот 2 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0703230000030002",
            "intro": "Филамент AMS4 слот 4 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0500020000020002",
            "intro": "Не удалось войти в систему; пожалуйста, проверьте информацию о своей учетной записи."
        },
        {
            "ecode": "0500030000020020",
            "intro": "Емкости карты microSD недостаточно для кэширования файлов печати."
        },
        {
            "ecode": "0703310000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "1201230000020002",
            "intro": "Филамент в AMS2 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702220000020005",
            "intro": "Филамент AMS3 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0703100000020002",
            "intro": "Двигатель AMS4 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1201120000010001",
            "intro": "Двигатель AMS2 слот 3 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0702100000020002",
            "intro": "Двигатель AMS3 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0500040000020013",
            "intro": "RFID-метка на AMS1 слот 4 не может быть идентифицирована."
        },
        {
            "ecode": "0700230000030001",
            "intro": "Филамент AMS1 слот 4 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0703200000020001",
            "intro": "Филамент в AMS4 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0C00030000020010",
            "intro": "Обнаруженны посторонние предметы, пожалуйста, проверьте и очистите стол."
        },
        {
            "ecode": "0703110000010001",
            "intro": "Двигатель слота 2 AMS4 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1202130000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 4 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0500030000010023",
            "intro": "Модуль CTC неисправен. Пожалуйста, перезагрузите устройство."
        },
        {
            "ecode": "1202120000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 3 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0500030000030022",
            "intro": "Обнаружено снижение производительности карты microSD. Это может повлиять на задания печати, журналы и видеозаписи. Пожалуйста, попробуйте отформатировать или заменить карту microSD."
        },
        {
            "ecode": "0700130000020002",
            "intro": "Двигатель AMS1 слот 4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0C0003000003000B",
            "intro": "Проверка первого слоя: пожалуйста, подождите немного."
        },
        {
            "ecode": "0703220000020001",
            "intro": "Филамент AMS4 слот 3 закончился. Пожалуйста, вставьте новый филамент."
        },
        {
            "ecode": "1201100000010001",
            "intro": "Двигатель AMS2 слот 1 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200500000020001",
            "intro": "Связь AMS1 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "1200300000030003",
            "intro": "AMS1 слот 1 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "1202300000010001",
            "intro": "Катушка RFID AMS3 слот 1 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0703010000020002",
            "intro": "Вспомогательный электродвигатель AMS4 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0702200000020004",
            "intro": "Филамент AMS4 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "1203100000010003",
            "intro": "Управление крутящим моментом двигателя AMS4 слот 1 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "03000D000001000A",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "0C00030000030007",
            "intro": "Обнаружены возможные дефекты первого слоя. Пожалуйста, проверьте качество первого слоя и решите, следует ли остановить работу."
        },
        {
            "ecode": "1203810000020001",
            "intro": "Филамент в AMS4 слот 2 может запутаться или застрять."
        },
        {
            "ecode": "0500040000020015",
            "intro": "RFID-метка на AMS2 слот 2 не может быть идентифицирована."
        },
        {
            "ecode": "1202100000020002",
            "intro": "Двигатель AMS3 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1200510000030001",
            "intro": "AMS отключен; пожалуйста, загрузите филамент из держателя катушки."
        },
        {
            "ecode": "1200120000020002",
            "intro": "Двигатель AMS1 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0C00030000030008",
            "intro": "Были обнаружены возможные дефекты спагетти. Проверьте качество печати и решите, следует ли остановить задание."
        },
        {
            "ecode": "0701210000030002",
            "intro": "Филамент AMS2 слот 2 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0300020000010009",
            "intro": "Регулятор температуры сопла работает неправильно; возможно, сопло не установленно. Если вы хотите нагреть сопло без установки, пожалуйста, включите режим обслуживания на странице настроек."
        },
        {
            "ecode": "0700220000020005",
            "intro": "Филамент AMS1 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203230000030001",
            "intro": "Филасент AMS4 слот 4 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0702300000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0702010000010001",
            "intro": "Вспомогательный электродвигатель AMS3 вышел из строя. Возможно, экструзионное колесо изношено или филамент слишком тонкий."
        },
        {
            "ecode": "0C00030000020004",
            "intro": "Проверка первого слоя не поддерживается для текущего задания печати."
        },
        {
            "ecode": "0500030000020012",
            "intro": "ipcam дамп ядра, он восстанавливается."
        },
        {
            "ecode": "0703210000020005",
            "intro": "Филамент AMS4 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "12FF200000020007",
            "intro": "Не удалось проверить расположение филамента в печатной голове принтера; пожалуйста, нажмите для получения дополнительной справки."
        },
        {
            "ecode": "0703310000020002",
            "intro": "RFID-метка на AMS4 слот 2 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1200210000020005",
            "intro": "Филамент AMS1 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0702300000010001",
            "intro": "Плата RFID между AMS3 слот 1 и слот 2 имеет ошибку."
        },
        {
            "ecode": "1203200000020006",
            "intro": "Не удалось выдавить филамент AMS4 слот 1; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0700300000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1202200000030001",
            "intro": "Филасент AMS3 слот 1 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "1202210000020006",
            "intro": "Не удалось выдавить филамент AMS3 слот 2; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "1200210000020006",
            "intro": "Не удалось выдавить филамент AMS1 слот 2; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "1200100000010001",
            "intro": "Двигатель AMS1 слот 1 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0703130000010001",
            "intro": "Двигатель AMS4 слот 4 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0700450000020002",
            "intro": "Расстояние резки резака для нити слишком велико. Двигатель XY может потерять скорость."
        },
        {
            "ecode": "0701200000020003",
            "intro": "Филамент AMS2 слот 1 может быть сломан в системе AMS."
        },
        {
            "ecode": "0700230000020004",
            "intro": "Филамент AMS1 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "03000B0000010001",
            "intro": "Датчик усилия нагревательного слоя 2 слишком чувствителен. Возможно, он застрял между натяжным рычагом и опорой нагревательного слоя или регулировочный винт слишком туго затянут."
        },
        {
            "ecode": "0C00010000020008",
            "intro": "Не удалось получить изображение с камеры. Обнаружение скопления спагетти и работа Ии на данный момент недоступны."
        },
        {
            "ecode": "03000D0000010008",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "1203220000030001",
            "intro": "Филасент AMS4 слот 3 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0700200000020005",
            "intro": "Филамент AMS1 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700210000020003",
            "intro": "Филамент AMS1 слот 2 может быть сломан в системе AMS."
        },
        {
            "ecode": "0300910000010002",
            "intro": "Температура нагревателя камеры 1 ненормальная. Возможно, в нагревателе произошел разрыв цепи или сработал термопредохранитель."
        },
        {
            "ecode": "0703200000030001",
            "intro": "Филамент AMS4 слот 1 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0700210000020002",
            "intro": "AMS1 Слот 2 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "1203300000030003",
            "intro": "AMS4 слот 1 RFID не может быть прочитан из-за структурной ошибки."
        },
        {
            "ecode": "03000C0000010002",
            "intro": "Сигнал датчика силы нагрева 3 слабый. Датчик силы может быть неисправен или иметь плохое электрическое подключение."
        },
        {
            "ecode": "0702200000020005",
            "intro": "Филамент AMS3 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1201220000020006",
            "intro": "Не удалось выдавить филамент AMS2 слот 3; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0700300000020002",
            "intro": "RFID-метка на AMS1 слот 1 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "0300920000010006",
            "intro": "Температура нагревателя камеры 2 ненормальная. Датчик может иметь короткое замыкание."
        },
        {
            "ecode": "1203100000010001",
            "intro": "Двигатель AMS4 слот 1 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0C00010000020002",
            "intro": "Камера Micro Lidar неисправна, и связанные с ней функции могут не работать. Если это сообщение продолжает появляться на нескольких распечатках, обратитесь в отдел послепродажного обслуживания."
        },
        {
            "ecode": "1202220000020006",
            "intro": "Не удалось выдавить филамент AMS3 слот 3; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "030001000001000A",
            "intro": "Неправильный контроль температуры сопла, возможно, неисправна плата переменного тока."
        },
        {
            "ecode": "0300900000010004",
            "intro": "Не удалось прогреть камеру. Скорость вентилятора слишком низкая."
        },
        {
            "ecode": "1201200000030001",
            "intro": "Филасент AMS2 слот 1 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0701100000010003",
            "intro": "Управление крутящим моментом двигателя AMS2 слот 1 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0701200000020002",
            "intro": "AMS2 Слот 1 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0702300000010004",
            "intro": "Сбой чипа шифрования."
        },
        {
            "ecode": "1203200000020005",
            "intro": "Филамент AMS4 слот 1 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0C00010000010004",
            "intro": "Объектив камеры Micro Lidar загрязнен. Пожалуйста, очистите линзу."
        },
        {
            "ecode": "1202200000020002",
            "intro": "Филамент в AMS3 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200200000020004",
            "intro": "Филамент AMS1 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0700010000020002",
            "intro": "Вспомогательный электродвигатель AMS1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1200210000020001",
            "intro": "Филамент в AMS1 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200210000020002",
            "intro": "Филамент в AMS1 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "03000D000001000B",
            "intro": "Двигатель оси Z, по-видимому, заклинивает при движении. Пожалуйста, проверьте, нет ли посторонних предметов на ползунках Z или колесиках зубчатого ремня Z."
        },
        {
            "ecode": "1201200000020004",
            "intro": "Филамент AMS2 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0702310000020002",
            "intro": "RFID-метка на AMS3 слот 3 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1203220000020004",
            "intro": "Филамент AMS4 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0500040000020010",
            "intro": "RFID-метка на AMS1 слот 1 не может быть идентифицирована."
        },
        {
            "ecode": "1202220000030001",
            "intro": "Филасент AMS3 слот 3 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0703230000020001",
            "intro": "Филамент AMS4 слот 4 закончился. Пожалуйста, вставьте новый филамент."
        },
        {
            "ecode": "0C00020000020007",
            "intro": "Вертикальный лазер не горит. Пожалуйста, проверьте, соединение или то что может закрыывать обзор лазеру."
        },
        {
            "ecode": "1202220000020004",
            "intro": "Филамент AMS3 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0C00020000020009",
            "intro": "Вертикальный лазер недостаточно яркий в положении наведения. Пожалуйста, очистите или замените нагревательный элемент, если это сообщение появляется повторно."
        },
        {
            "ecode": "0701210000020005",
            "intro": "Филамент AMS2 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0300010000010006",
            "intro": "Температура подогрева ненормальная; датчик может иметь короткое замыкание."
        },
        {
            "ecode": "0702010000020002",
            "intro": "Вспомогательный электродвигатель AMS3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1202230000030001",
            "intro": "Филасент AMS3 слот 4 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "1202330000010001",
            "intro": "Катушка RFID AMS3 слот 4 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1202230000020004",
            "intro": "Филамент AMS3 слот 4 может быть сломан в печатной голове."
        },
        {
            "ecode": "0700620000020001",
            "intro": "Слот 3 AMS1 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0300020000010006",
            "intro": "Температура сопла ненормальная; датчик может иметь короткое замыкание, проверьте, правильно ли подключен разъем."
        },
        {
            "ecode": "03001B0000010001",
            "intro": "Сигнал датчика ускорения нагрева слаб. Сенсор может выпасть или быть поврежден."
        },
        {
            "ecode": "0300010000030008",
            "intro": "Температура кровати превышает предельную и автоматически настраивается на предельную температуру."
        },
        {
            "ecode": "0702630000020001",
            "intro": "Слот 4 AMS4 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0300900000010002",
            "intro": "Произошел сбой в нагреве камеры. Возможно, камера не закрыта, или температура окружающей среды слишком низкая, или отверстие для отвода тепла источника питания заблокировано."
        },
        {
            "ecode": "1200110000020002",
            "intro": "Двигатель AMS1 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0702200000020001",
            "intro": "Филамент в AMS3 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1202320000010001",
            "intro": "Катушка RFID AMS3 слот 3 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1200320000020002",
            "intro": "RFID-метка на AMS1 слот 3 повреждена."
        },
        {
            "ecode": "1202210000030002",
            "intro": "Филамент в AMS3 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703210000030001",
            "intro": "Филамент AMS4 слот 2 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1201300000010004",
            "intro": "RFID не может быть прочитан из-за сбоя чипа шифрования в AMS2."
        },
        {
            "ecode": "1203210000020001",
            "intro": "Филамент в AMS4 слот 2 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203500000020001",
            "intro": "Связь AMS4 неисправна; пожалуйста, проверьте соединительный кабель."
        },
        {
            "ecode": "1203800000020001",
            "intro": "Филамент в AMS4 слот 1 может запутаться или застрять."
        },
        {
            "ecode": "1200320000010001",
            "intro": "Катушка RFID AMS1 слот 3 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0702120000010001",
            "intro": "Двигатель AMS3 слот 3 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0700600000020001",
            "intro": "Слот 1 AMS1 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0702230000020002",
            "intro": "AMS3 Слот 4 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0500040000020007",
            "intro": "Температура слоя превышает температуру застывания филамента, что может привести к засорению сопла. Держите переднюю дверцу принтера открытой или уменьшите температуру стола."
        },
        {
            "ecode": "0700210000020004",
            "intro": "Филамент AMS1 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "0702300000020002",
            "intro": "RFID-метка на AMS3 слот 1 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1200720000010001",
            "intro": "AMS1 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 3."
        },
        {
            "ecode": "0702210000030002",
            "intro": "Филамент AMS3 слот 2 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0300200000010003",
            "intro": "Неправильное возвращение оси X: возможно, ремень Грм ослаблен."
        },
        {
            "ecode": "0702230000030002",
            "intro": "Филамент AMS3 слот 4 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "1200300000010001",
            "intro": "Катушка RFID AMS1 слот 1 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "1203200000030002",
            "intro": "Филамент в AMS4 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200120000010003",
            "intro": "Управление крутящим моментом двигателя AMS1 слот 3 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0701210000030001",
            "intro": "Филамент AMS2 слот 2 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0300930000010002",
            "intro": "Температура камеры ненормальная. Датчик температуры камерного нагревателя может иметь разрыв цепи."
        },
        {
            "ecode": "0500040000020011",
            "intro": "RFID-метка на AMS1 слот 2 не может быть идентифицирована."
        },
        {
            "ecode": "0300910000010001",
            "intro": "Температура нагревателя камеры 1 ненормальная. Возможно, в нагревателе произошло короткое замыкание."
        },
        {
            "ecode": "0703620000020001",
            "intro": "Слот 3 AMS4 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "07FF200000020004",
            "intro": "Пожалуйста, вытащите филамент из экструдера."
        },
        {
            "ecode": "0703210000020001",
            "intro": "Филамент AMS4 слот 2 закончился. Пожалуйста, вставьте новый филамент."
        },
        {
            "ecode": "1201110000020002",
            "intro": "Двигатель AMS2 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0701300000020002",
            "intro": "RFID-метка на AMS2 слот 1 повреждена или ее содержимое невозможно идентифицировать."
        },
        {
            "ecode": "1200710000010001",
            "intro": "AMS1 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 2."
        },
        {
            "ecode": "1202210000030001",
            "intro": "Филасент AMS3 слот 2 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "1202110000020002",
            "intro": "Двигатель AMS3 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0300920000010001",
            "intro": "Температура нагревателя камеры 2 ненормальная. Возможно, в нагревателе произошло короткое замыкание."
        },
        {
            "ecode": "12FF200000030007",
            "intro": "Проверка расположения филамента во всех слотах AMS, пожалуйста, подождите."
        },
        {
            "ecode": "1202310000010001",
            "intro": "Катушка RFID AMS3 слот 2 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0700220000030002",
            "intro": "Филамент AMS1 слот 3 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0703230000020005",
            "intro": "Филамент AMS4 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0700220000020004",
            "intro": "Филамент AMS1 слот 3 может быть сломан в печатной голове."
        },
        {
            "ecode": "0300050000010001",
            "intro": "Драйвер двигателя перегревается. Возможно, его радиатор ослаблен или вентилятор охлаждения может быть поврежден."
        },
        {
            "ecode": "1201830000020001",
            "intro": "Филамент в AMS2 слот 4 может запутаться или застрять."
        },
        {
            "ecode": "0C0003000003000E",
            "intro": "Кажется, Ваш принтер печатает без выдавливания филамента."
        },
        {
            "ecode": "1203700000010001",
            "intro": "AMS4 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 1."
        },
        {
            "ecode": "0702210000020005",
            "intro": "Филамент AMS3 слот 2 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0701220000020001",
            "intro": "Филамент в AMS2 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203220000030002",
            "intro": "Филамент в AMS4 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0300020000010003",
            "intro": "Температура сопла ненормальная; нагреватель перегрелся."
        },
        {
            "ecode": "1203230000030002",
            "intro": "Филамент в AMS4 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1200130000010001",
            "intro": "Двигатель AMS1 слот 4 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200120000010001",
            "intro": "Двигатель AMS1 слот 3 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0300090000010002",
            "intro": "У двигателя-E короткое замыкание. Возможно, он вышел из строя."
        },
        {
            "ecode": "1200200000020003",
            "intro": "Филамент AMS1 слот 1 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "0701130000010001",
            "intro": "Двигатель AMS2 слот 4 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1201320000020002",
            "intro": "RFID-метка на AMS2 слот 3 повреждена."
        },
        {
            "ecode": "0500040000030009",
            "intro": "Температура слоя превышает температуру застывания филамента, что может привести к засорению сопла. Пожалуйста, держите переднюю дверцу принтера открытой. Временно отключено обнаружение открывания дверцы."
        },
        {
            "ecode": "0702110000010001",
            "intro": "Двигатель AMS3 слот 2 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1200810000020001",
            "intro": "Филамент в AMS1 слот 2 может запутаться или застрять."
        },
        {
            "ecode": "0300170000010001",
            "intro": "Скорость вентилятора сопла слишком низкая или остановлена. Возможно, он застрял или разъем подключен неправильно."
        },
        {
            "ecode": "0300030000010001",
            "intro": "Скорость вентилятора сопла слишком низкая или остановлена. Возможно, он застрял или разъем неправильно подключен."
        },
        {
            "ecode": "0703120000010001",
            "intro": "Двигатель AMS4 слот 3 проскальзывает. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "0300080000010002",
            "intro": "У Motor-Z короткое замыкание. Возможно, он вышел из строя."
        },
        {
            "ecode": "0702600000020001",
            "intro": "Слот 1 AMS3 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "1200210000030001",
            "intro": "Филасент AMS1 слот 2 закончился. Очистка старого филамента; пожалуйста, подождите."
        },
        {
            "ecode": "0C00030000020005",
            "intro": "Тайм-аут проверки первого слоя истек, и текущие результаты могут быть неточными."
        },
        {
            "ecode": "0300400000020001",
            "intro": "Передача данных через последовательный порт ненормальна; система программного обеспечения может быть неисправна."
        },
        {
            "ecode": "03000C0000010005",
            "intro": "Датчик усилия 3 обнаружил неожиданное непрерывное усилие. Возможно, нагревательный элемент застрял или аналоговая передняя панель сломана."
        },
        {
            "ecode": "03000D0000010007",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "0702230000020005",
            "intro": "Филамент AMS3 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0701100000020002",
            "intro": "Двигатель AMS2 слот 1 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0703300000010001",
            "intro": "Плата RFID между AMS4 слот 1 и слот 2 имеет ошибку."
        },
        {
            "ecode": "0300060000010002",
            "intro": "Двигатель-А имеет короткое замыкание. Возможно, он вышел из строя."
        },
        {
            "ecode": "0300930000010008",
            "intro": "Температура камеры ненормальная. Датчик температуры на блоке питания может иметь разрыв цепи."
        },
        {
            "ecode": "1202220000020002",
            "intro": "Филамент в AMS3 слот 3 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203730000010001",
            "intro": "AMS4 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 4."
        },
        {
            "ecode": "1200830000020001",
            "intro": "Филамент в AMS1 слот 4 может запутаться или застрять."
        },
        {
            "ecode": "0703120000020002",
            "intro": "Двигатель AMS4 слот 3 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0701610000020001",
            "intro": "Слот 2 AMS2 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0702110000020002",
            "intro": "Двигатель AMS3 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "1201130000010001",
            "intro": "Двигатель AMS2 слот 4 вышел из строя. Возможно, экструзионное колесо неисправно или филамент слишком тонкий."
        },
        {
            "ecode": "1202230000020006",
            "intro": "Не удалось выдавить филамент AMS3 слот 4; возможно, экструдер засорен или филамент слишком тонкий, что приводит к проскальзыванию экструдера."
        },
        {
            "ecode": "0703230000020003",
            "intro": "Филамент AMS4 слот 4 может быть сломан в системе AMS."
        },
        {
            "ecode": "0702220000020002",
            "intro": "AMS3 Слот 3 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "1201300000010001",
            "intro": "Катушка RFID AMS2 слот 1 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0C00020000020004",
            "intro": "Высота сопла кажется слишком низкой. Пожалуйста, проверьте, не изношено ли сопло и не наклонено ли оно. Повторно откалибруйте лидар, если сопло было заменено."
        },
        {
            "ecode": "0300940000030002",
            "intro": "Установленное значение температуры камеры превысит предельное значение, будет установлено максимально допустимое значение."
        },
        {
            "ecode": "0300180000010004",
            "intro": "Данные датчика силы экструзии ненормальны, датчик может быть сломан."
        },
        {
            "ecode": "0702010000010004",
            "intro": "Вспомогательный регулятор крутящего момента двигателя AMS3 неисправен. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0703630000020001",
            "intro": "Слот 4 AMS4 перегружен. Филамент может запутаться или катушка застряла."
        },
        {
            "ecode": "0702220000030001",
            "intro": "Филамент AMS3 слот 3 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "0700230000020002",
            "intro": "AMS1 Слот 4 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "1202230000020002",
            "intro": "Филамент в AMS3 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "12FF200000020006",
            "intro": "Не удалось выдавить филамент, возможно, экструдер засорен."
        },
        {
            "ecode": "1203230000020001",
            "intro": "Филамент в AMS4 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1203230000020005",
            "intro": "Филамент AMS4 слот 4 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "1203110000010003",
            "intro": "Управление крутящим моментом двигателя AMS4 слот 2 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0C00010000020007",
            "intro": "Параметры лазера микролидара отклоняются. Пожалуйста, повторите калибровку принтера."
        },
        {
            "ecode": "0500030000020011",
            "intro": "дамп памяти, он восстанавливается."
        },
        {
            "ecode": "0701220000020003",
            "intro": "Филамент AMS2 слот 3 может быть сломан в системе AMS."
        },
        {
            "ecode": "0300060000010001",
            "intro": "Двигатель-А имеет обрыв цепи. Возможно, соединение ослаблено или двигатель вышел из строя."
        },
        {
            "ecode": "0702210000020002",
            "intro": "AMS3 Слот 2 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "0500030000010021",
            "intro": "Апаратная несовместимость, пожалуйста, проверьте лазер."
        },
        {
            "ecode": "1203120000010003",
            "intro": "Управление крутящим моментом двигателя AMS4 слот 3 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0300930000010007",
            "intro": "Температура в камере ненормальная. Возможно, произошло короткое замыкание датчика температуры в блоке питания."
        },
        {
            "ecode": "0700200000030002",
            "intro": "Филамент AMS1 слот 1 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "0500010000030007",
            "intro": "Невозможно записать замедленную съемку без вставленной карты microSD."
        },
        {
            "ecode": "03001B0000010003",
            "intro": "Датчик стола обнаружил постоянное усилие. Возможно, датчик заклинило или аналоговый интерфейс неисправен."
        },
        {
            "ecode": "050004000002001A",
            "intro": "RFID-метка на AMS3 слот 3 не может быть идентифицирована."
        },
        {
            "ecode": "1203710000010001",
            "intro": "AMS4 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 2."
        },
        {
            "ecode": "0702230000020001",
            "intro": "Филамент в AMS3 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0C0001000001000B",
            "intro": "Не удалось откалибровать микролидар. Убедитесь, что калибровочная таблица чистая и не засорена, и повторите калибровку принтера."
        },
        {
            "ecode": "1201200000020002",
            "intro": "Филамент в AMS2 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "1201230000030002",
            "intro": "Филамент в AMS2 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0700400000020001",
            "intro": "Потерян сигнал положения буфера филамента: возможно, неисправен кабель или датчик положения."
        },
        {
            "ecode": "1202110000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 2 неисправно. Возможно, датчик тока неисправен."
        },
        {
            "ecode": "0500010000030005",
            "intro": "Ошибка карты MicroSD: пожалуйста, переустановите, отформатируйте или замените ее."
        },
        {
            "ecode": "1200230000020001",
            "intro": "Филамент в AMS1 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0300940000030001",
            "intro": "Охлаждение камеры может быть слишком медленным. Вы можете открыть камеру, чтобы облегчить охлаждение, если газ в камере нетоксичный."
        },
        {
            "ecode": "0C0003000003000F",
            "intro": "Кажется, что Ваше сопло покрыто застрявшим или засоренным материалом."
        },
        {
            "ecode": "1201330000010001",
            "intro": "Катушка RFID AMS2 слот 4 неисправна или в радиочастотной аппаратной схеме возникла ошибка."
        },
        {
            "ecode": "0702100000010003",
            "intro": "Управление крутящим моментом двигателя AMS3 слот 1 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "0500010000030006",
            "intro": "Неформатированная карта MicroSD: отформатируйте ее."
        },
        {
            "ecode": "1201200000020001",
            "intro": "Филамент в AMS2 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0702020000010001",
            "intro": "AMS3 Ошибка скорости и длины нити: возможно, одометрия нити неисправна."
        },
        {
            "ecode": "1201200000030002",
            "intro": "Филамент в AMS2 слот 1 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0703210000020004",
            "intro": "Филамент AMS4 слот 2 может быть сломан в печатной голове."
        },
        {
            "ecode": "1202200000020003",
            "intro": "Филамент AMS3 слот 1 может быть сломан в трубке из PTFE."
        },
        {
            "ecode": "1200220000020005",
            "intro": "Филамент AMS1 слот 3 закончился, и продувка старого филамента прошла неправильно; пожалуйста, проверьте, не застрял ли филамент в печатной головке."
        },
        {
            "ecode": "0C00030000020001",
            "intro": "Измерение экспозиции филамента не удалось, поскольку отражение лазера от этого материала слишком слабое. Проверка первого слоя может быть неточной."
        },
        {
            "ecode": "1202820000020001",
            "intro": "Филамент в AMS3 слот 3 может запутаться или застрять."
        },
        {
            "ecode": "12FF200000020002",
            "intro": "Филамент закончился; пожалуйста, загрузите новый."
        },
        {
            "ecode": "0703300000030003",
            "intro": "RFID не может быть прочитан из-за аппаратной или структурной ошибки."
        },
        {
            "ecode": "0703100000010003",
            "intro": "Управление крутящим моментом двигателя слота 1 AMS4 неисправно. Датчик тока может быть неисправен."
        },
        {
            "ecode": "1200300000020002",
            "intro": "RFID-метка на AMS1 слот 1 повреждена."
        },
        {
            "ecode": "1200700000010001",
            "intro": "AMS1 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 1."
        },
        {
            "ecode": "0701200000020004",
            "intro": "Филамент AMS2 слот 1 может быть сломан в печатной голове."
        },
        {
            "ecode": "0500010000020002",
            "intro": "USB-камера не подключена. Пожалуйста, проверьте подключение кабеля видеокамеры."
        },
        {
            "ecode": "0C00020000010005",
            "intro": "Обнаружен новый микролидар. Пожалуйста, откалибруйте его на странице калибровки перед использованием."
        },
        {
            "ecode": "0702200000020002",
            "intro": "AMS3 Слот 1 пуст; пожалуйста, вставьте филамент."
        },
        {
            "ecode": "03000C0000010003",
            "intro": "Сигнал датчика силы нагрева 3 слишком слабый. Возможно, нарушено электронное подключение к датчику."
        },
        {
            "ecode": "03000D0000010004",
            "intro": "Рабочая пластина установлена неправильно. Пожалуйста, отрегулируйте ее."
        },
        {
            "ecode": "03000C0000010001",
            "intro": "Датчик усилия нагревательного слоя 3 слишком чувствителен. Возможно, он застрял между натяжным рычагом и опорой нагревательного слоя или регулировочный винт затянут слишком туго."
        },
        {
            "ecode": "0702210000030001",
            "intro": "Филамент AMS3 слот 1 закончился. Пожалуйста, подождите, пока старый филамент будет удален."
        },
        {
            "ecode": "1201230000020001",
            "intro": "Филамент в AMS2 слот 4 закончился; пожалуйста, вставьте новый."
        },
        {
            "ecode": "0700230000020003",
            "intro": "Филамент AMS1 слот 4 может быть сломан в системе AMS."
        },
        {
            "ecode": "0703110000020002",
            "intro": "Двигатель AMS4 слот 2 перегружен. Филамент может запутаться или застрять."
        },
        {
            "ecode": "0701220000030002",
            "intro": "Филамент AMS2 слот 3 закончился и автоматически переключается на слот с тем же филаментом."
        },
        {
            "ecode": "1203720000010001",
            "intro": "AMS4 Ошибка скорости и длины филамента: Возможно, неисправен одометр филамента слот 3."
        }
    ],
    "ver": 202406020147
}