{
    "tr": [
        {
            "ecode": "1202120000010003",
            "intro": "AMS3 Yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300010000010002",
            "intro": "Isı yatağı sıcaklığı düzgün değil; ısıtıcıda açık devre olabilir veya termal anahtar açık olabilir."
        },
        {
            "ecode": "050004000002001F",
            "intro": "AMS4 Yuva4 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1203100000020002",
            "intro": "AMS4 Yuva1 motoru aşırı yüklenmiş. Filament  karışmış veya  sıkışmış olabilir."
        },
        {
            "ecode": "0C00020000020006",
            "intro": "Nozul yüksekliği çok yüksek görünüyor. Lütfen nozüle bağlı filament kalıntısı olup olmadığını kontrol edin."
        },
        {
            "ecode": "0702220000030002",
            "intro": "AMS3 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0500010000030006",
            "intro": "Biçimlendirilmemiş MicroSD Kart: lütfen biçimlendirin."
        },
        {
            "ecode": "0500030000020016",
            "intro": "device_manager bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "0703130000010001",
            "intro": "AMS4 Slot4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203130000010001",
            "intro": "AMS4 Yuva4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1201200000020001",
            "intro": "AMS2 Yuva1 filamenti tükendi; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202200000030001",
            "intro": "AMS3 Yuva1 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "1201210000030002",
            "intro": "AMS2 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1200120000020002",
            "intro": "AMS1 Yuva3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1201310000030003",
            "intro": "AMS2 Yuva2 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1202230000030002",
            "intro": "AMS3 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700120000010001",
            "intro": "AMS1 slot3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203210000020001",
            "intro": "AMS4 Yuva2 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1203200000020002",
            "intro": "AMS4 Yuva1 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1201230000030002",
            "intro": "AMS2 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700020000010001",
            "intro": "AMS1 Filament hızı ve uzunluğu hatası: Filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1202200000020005",
            "intro": "AMS3 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0702210000020003",
            "intro": "AMS3 Slot2'nin filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1200100000020002",
            "intro": "AMS1 Yuva1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1202230000030001",
            "intro": "AMS3 Yuva4 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0500030000010021",
            "intro": "Donanım uyumsuz, lütfen lazeri kontrol edin."
        },
        {
            "ecode": "1203100000010001",
            "intro": "AMS4  Yuva1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0300930000010006",
            "intro": "Hazne sıcaklığı düzgün değil. Hava girişindeki hazne ısıtıcısının sıcaklık sensöründe açık devre olabilir."
        },
        {
            "ecode": "0300180000020002",
            "intro": "Ekstrüzyon kuvveti sensörünün hassasiyeti düşüktür, hotend doğru takılmamış olabilir."
        },
        {
            "ecode": "0300030000020002",
            "intro": ""
        },
        {
            "ecode": "1200330000030003",
            "intro": "AMS1 Yuva4 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1203120000010003",
            "intro": "AMS4 Yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0703210000020001",
            "intro": "AMS4 Yuva2 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202220000030001",
            "intro": "AMS3 Yuva3 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0701010000010001",
            "intro": "AMS2 destek motoru kaymıştır. Ekstrüzyon çarkı aşınmış olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203200000020001",
            "intro": "AMS4 Yuva1 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0300180000010004",
            "intro": "Ekstrüzyon kuvveti sensöründen gelen veriler düzgün değildir, sensör bozulmuş olabilir."
        },
        {
            "ecode": "0700220000020004",
            "intro": "AMS1 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1200230000020006",
            "intro": "AMS1 Yuva4 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0300040000020001",
            "intro": "Parça soğutma fanının hızı çok yavaş veya durmuş. Sıkışmış olabilir veya konektör düzgün takılmamış olabilir."
        },
        {
            "ecode": "1200820000020001",
            "intro": "AMS1 Yuva3 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0C0003000002000C",
            "intro": "Yapı plakası lokalizasyon işaretleyicisi algılanmadı. Lütfen yapı plakasının doğru hizalanıp hizalanmadığını kontrol edin."
        },
        {
            "ecode": "0701310000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1200450000020003",
            "intro": "Filament kesici kolu serbest bırakılmamış. Sap veya bıçak sıkışmış olabilir."
        },
        {
            "ecode": "0701200000020002",
            "intro": "AMS2 Yuva1 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0300020000010003",
            "intro": "Nozul sıcaklığı düzgün değil; ısıtıcı aşırı sıcak."
        },
        {
            "ecode": "0300010000010006",
            "intro": "Isı yatağı sıcaklığı düzgün değil; sensörde kısa devre olabilir."
        },
        {
            "ecode": "1200810000020001",
            "intro": "AMS1 Yuva2 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300900000010005",
            "intro": "Hazne ısıtması başarısız oldu. Termal direnç çok yüksek."
        },
        {
            "ecode": "0701220000030001",
            "intro": "AMS2 Yuva3 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "1200200000020004",
            "intro": "AMS1 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0300090000010001",
            "intro": "Motor-E'de açık devre var. Bağlantı gevşek olabilir veya motor arızalanmış olabilir."
        },
        {
            "ecode": "1201230000020001",
            "intro": "AMS2 Yuva4 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "12FF200000020005",
            "intro": "Filament, takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0701230000020004",
            "intro": "AMS2 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0C00010000020002",
            "intro": "Mikro Lidar kamera arızalı ve ilgili işlevler başarısız olabilir. Bu mesaj birden fazla baskıda görünmeye devam ederse lütfen satış sonrası ile iletişime geçin."
        },
        {
            "ecode": "0703320000020002",
            "intro": "AMS4 Yuva3 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "03000A0000010001",
            "intro": "Isı yatağı kuvvet sensörü 1 çok hassas. Germe kolu ile ısı yatağı desteği arasına sıkışmış olabilir veya ayar vidası çok sıkı olabilir."
        },
        {
            "ecode": "0703210000020003",
            "intro": "AMS4 Slot2'in filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0300920000010003",
            "intro": "Hazne ısıtıcı 2'nin sıcaklığı düzgün değil. Isıtıcı aşırı sıcaktır."
        },
        {
            "ecode": "0701120000010003",
            "intro": "AMS2 yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1200220000020002",
            "intro": "AMS1 Yuva3 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0702220000020004",
            "intro": "AMS3 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1200200000020001",
            "intro": "AMS1 Yuva1 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202200000030002",
            "intro": "AMS3 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1202730000010001",
            "intro": "AMS3 Filament hızı ve uzunluğu hatası: Yuva 4 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1201210000020004",
            "intro": "AMS2 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0C00030000020002",
            "intro": "İlk katman denetimi düzgün değil Lidar verileri nedeniyle sonlandırıldı."
        },
        {
            "ecode": "1201110000020002",
            "intro": "AMS2 Yuva2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1200100000010001",
            "intro": "AMS1 Yuva1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0300930000010007",
            "intro": "Hazne sıcaklığı düzgün değil. Güç kaynağındaki sıcaklık sensöründe kısa devre olabilir."
        },
        {
            "ecode": "1202130000020002",
            "intro": "AMS3 Yuva4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "03001B0000010001",
            "intro": "Isı yatağı hızlanma sensörünün sinyali zayıf. Sensör düşmüş veya hasar görmüş olabilir."
        },
        {
            "ecode": "1202210000020004",
            "intro": "AMS3 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0300100000020002",
            "intro": "X ekseninin rezonans frekansı son kalibrasyondan büyük ölçüde farklıdır. Lütfen karbon çubuğu temizleyin ve ardından makine kalibrasyonunu yeniden çalıştırın."
        },
        {
            "ecode": "0300110000020001",
            "intro": "Y ekseninin rezonans frekansı düşüktür. Triger kayışı gevşek olabilir."
        },
        {
            "ecode": "1203210000020004",
            "intro": "AMS4 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1201230000020004",
            "intro": "AMS2 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0500040000030009",
            "intro": "Yatak sıcaklığı filamentin yumşama sıcaklığını aşar, bu da nozül tıkanmasına neden olabilir. Lütfen yazıcının ön kapağını açık tutun. Kapı açma algılamasını geçici olarak kapatın."
        },
        {
            "ecode": "0700100000010001",
            "intro": "AMS1 slot1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0702110000020002",
            "intro": "AMS3 slot2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300200000010004",
            "intro": "Y ekseni sıfırlanması düzgün değil: triger kayışı gevşek olabilir."
        },
        {
            "ecode": "0500030000030022",
            "intro": "MicroSD Kart performansında bozulma tespit edildi. Yazdırma işlerini, günlükleri ve video kayıtlarını etkileyebilir. Lütfen MicroSD kartı biçimlendirmeyi veya değiştirmeyi deneyin."
        },
        {
            "ecode": "03001B0000010002",
            "intro": "Isı yatağı hızlanma sensöründe harici bozulma tespit edildi. Sensör sinyal kablosu sabitlenmemiş olabilir."
        },
        {
            "ecode": "1203310000020002",
            "intro": "AMS4 Yuva2 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0701020000010001",
            "intro": "AMS2 Filament hızı ve uzunluğu hatası: Filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0C00030000020001",
            "intro": "Bu malzemede lazer yansıması çok zayıf olduğu için filament pozlama ölçümü başarısız oldu. İlk katman denetimi hatalı olabilir."
        },
        {
            "ecode": "0C00010000020008",
            "intro": "Oda kamerasından görüntü alınamadı. Spagetti ve fazla şut yığılması tespiti şimdilik mevcut değil."
        },
        {
            "ecode": "1203820000020001",
            "intro": "AMS4 Yuva3 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0703120000010003",
            "intro": "AMS4 yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0500030000020015",
            "intro": "device_gate bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "1200220000020006",
            "intro": "AMS1 Yuva3 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0500040000020012",
            "intro": "AMS1 Yuva3 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "03001A0000020001",
            "intro": "Nozül filamentlerle kaplıdır veya yapı plakası eğri yerleştirilmiştir."
        },
        {
            "ecode": "0300930000010008",
            "intro": "Hazne sıcaklığı düzgün değil. Güç kaynağındaki sıcaklık sensöründe açık devre olabilir."
        },
        {
            "ecode": "1203220000020001",
            "intro": "AMS4 Yuva3 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "0701210000030001",
            "intro": "AMS2 Yuva2 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "050003000001000B",
            "intro": "Ekran arızalı; lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "0500030000020013",
            "intro": "xcam bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "1202230000020001",
            "intro": "AMS3 Yuva4 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "0300900000010003",
            "intro": "Hazne ısıtması başarısız oldu. Güç kaynağının sıcaklığı çok yüksek olabilir."
        },
        {
            "ecode": "03000B0000010002",
            "intro": "Isı yatağı kuvvet sensörü 2'nin sinyali zayıf. Kuvvet sensörü kırılmış veya elektrik bağlantısı zayıf olabilir."
        },
        {
            "ecode": "1202230000020004",
            "intro": "AMS3 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1200110000020002",
            "intro": "AMS1 Yuva2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701130000020002",
            "intro": "AMS2 slot4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "07FF200000020002",
            "intro": "Harici filament eksik; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0702110000010003",
            "intro": "AMS3 yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0703110000010003",
            "intro": "AMS4 yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1203300000020002",
            "intro": "AMS4 Yuva1 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0701210000020002",
            "intro": "AMS2 Yuva2 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "03000D0000010005",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "1203220000020006",
            "intro": "AMS4 Yuva3 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0500040000020019",
            "intro": "AMS3 Yuva2 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0700310000010001",
            "intro": "AMS1 Yuva3 ve Yuva4 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0C0003000003000B",
            "intro": "İlk katman inceleniyor: lütfen bir dakika bekleyin."
        },
        {
            "ecode": "1202220000020004",
            "intro": "AMS3 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "03000A0000010004",
            "intro": "Kuvvet sensörü 1'de harici bir bozulma tespit edildi. Isı yatağı plakası ısı yatağının dışında bir şeye temas etmiş olabilir."
        },
        {
            "ecode": "0701100000020002",
            "intro": "AMS2 slot1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701110000010003",
            "intro": "AMS2 yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1203200000020004",
            "intro": "AMS4 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0500030000010008",
            "intro": "Bir sistem kilitlenmesi meydana geldi. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "0500030000010023",
            "intro": "CTC modülü arızalı. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "1201230000020006",
            "intro": "AMS2 Yuva4 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0300050000010001",
            "intro": "Motor sürücüsü aşırı ısınıyor. Radyatörü gevşek olabilir veya soğutma fanı hasar görmüş olabilir."
        },
        {
            "ecode": "1200220000030002",
            "intro": "AMS1 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0702310000020002",
            "intro": "AMS3 Yuva2 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1200220000020004",
            "intro": "AMS1 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1200730000010001",
            "intro": "AMS1 Filament hızı ve uzunluğu hatası: Yuva 4 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0701210000020001",
            "intro": "AMS2 Yuva2 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "03000A0000010003",
            "intro": "Isı yatağı kuvvet sensörü 1'in sinyali çok zayıf. Sensöre giden elektronik bağlantı kopmuş olabilir."
        },
        {
            "ecode": "1202100000010003",
            "intro": "AMS3 Yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0700450000020002",
            "intro": "Filament kesicinin kesme mesafesi çok büyük. XY motoru adımları kaybedebilir."
        },
        {
            "ecode": "0701130000010003",
            "intro": "AMS2 yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0500040000010004",
            "intro": "Yazdırma dosyası yetkisizdir."
        },
        {
            "ecode": "0C00020000020009",
            "intro": "Dikey lazer, hedefleme konumunda yeterince parlak değil. Bu mesaj tekrar tekrar görünürse lütfen ısı yatağını temizleyin veya değiştirin."
        },
        {
            "ecode": "1203330000030003",
            "intro": "AMS4 Yuva4 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0702230000020002",
            "intro": "AMS3 Yuva4 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0702220000020001",
            "intro": "AMS3 Yuva3 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0700320000020002",
            "intro": "AMS1 Yuva3 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0700230000030001",
            "intro": "AMS1 Yuva4 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0300020000010007",
            "intro": "Nozul sıcaklığı düzgün değil; sensörde açık devre olabilir."
        },
        {
            "ecode": "1201700000010001",
            "intro": "AMS2 Filament hızı ve uzunluğu hatası: Yuva 1 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0C00020000010001",
            "intro": "Yatay lazer yanmıyor. Lütfen kapalı olup olmadığını veya donanım bağlantısının normal olup olmadığını kontrol edin."
        },
        {
            "ecode": "0500040000020015",
            "intro": "AMS2 Yuva2 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1200220000020003",
            "intro": "AMS1 Yuva3 filamenti PTFE tüpünde kırılmış olabilir."
        },
        {
            "ecode": "1201320000020002",
            "intro": "AMS2 Yuva3 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0300910000010002",
            "intro": "Hazne ısıtıcısının 1 sıcaklığı düzgün değil. Isıtıcıda açık devre olabilir veya termal sigorta devreye girmiş olabilir."
        },
        {
            "ecode": "1203800000020001",
            "intro": "AMS4 Yuva1 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0703230000020001",
            "intro": "AMS4 Yuva4 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703200000020003",
            "intro": "AMS4 Slot1'in filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1202110000020002",
            "intro": "AMS3 Yuva2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700500000020001",
            "intro": "AMS1 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "0703130000020002",
            "intro": "AMS4 slot4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1201220000030001",
            "intro": "AMS2 Yuva3 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0701100000010001",
            "intro": "AMS2 slot1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0500040000020016",
            "intro": "AMS2 Yuva3 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1202230000020003",
            "intro": "AMS3 Yuva4 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0702320000020002",
            "intro": "AMS3 Yuva3 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1200200000020006",
            "intro": "AMS1 Yuva1 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0500040000020011",
            "intro": "AMS1 Yuva2 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0700220000020001",
            "intro": "AMS1 Yuva3 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "03000C0000010004",
            "intro": "Kuvvet sensörü 3'te harici bir bozulma tespit edildi. Isı yatağı plakası ısı yatağının dışında bir şeye temas etmiş olabilir."
        },
        {
            "ecode": "1203230000020001",
            "intro": "AMS4 Yuva4 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "1200100000010003",
            "intro": "AMS1 Yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0702100000020002",
            "intro": "AMS3 slot1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1202200000020001",
            "intro": "AMS3 Yuva1 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202210000030002",
            "intro": "AMS3 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0703110000020002",
            "intro": "AMS4 slot2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0703220000020003",
            "intro": "AMS4 Slot3'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0C0003000003000F",
            "intro": "Nozulunuz sıkışmış veya tıkanmış malzeme ile kaplı görünüyor."
        },
        {
            "ecode": "12FF800000020001",
            "intro": "Makara tutucusundaki filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "03000D0000010009",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "0700100000020002",
            "intro": "AMS1 slot1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701600000020001",
            "intro": "AMS2 yuva1 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1203230000020005",
            "intro": "AMS4 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0300160000010001",
            "intro": "Motor-E'nin akım sensörü düzgün değil. Bunun nedeni donanım örnekleme devresindeki bir arıza olabilir."
        },
        {
            "ecode": "0702210000030002",
            "intro": "AMS3 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0500010000020002",
            "intro": "USB kamera bağlı değil. Lütfen video kamera kablo bağlantısını kontrol edin."
        },
        {
            "ecode": "1202220000020001",
            "intro": "AMS3 Yuva3 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "0702230000030001",
            "intro": "AMS3 Yuva4 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0701200000030001",
            "intro": "AMS2 Yuva1 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0300900000010001",
            "intro": "Hazne ısıtması başarısız. Hazne ısıtıcısı sıcak hava üflemiyor olabilir."
        },
        {
            "ecode": "03000B0000010003",
            "intro": "Isı yatağı kuvvet sensörü 2'nin sinyali çok zayıf. Sensöre giden elektronik bağlantı kopmuş olabilir."
        },
        {
            "ecode": "1201110000010001",
            "intro": "AMS4 Yuva2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1202100000020002",
            "intro": "AMS3 Yuva1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700230000020001",
            "intro": "AMS1 Yuva4 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0700400000020001",
            "intro": "Filament tampon konum sinyali kayboldu: kablo veya konum sensörü arızalı olabilir."
        },
        {
            "ecode": "0700230000030002",
            "intro": "AMS1 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1201210000030001",
            "intro": "AMS2 Yuva2 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0300930000010005",
            "intro": "Hazne sıcaklığı düzgün değil. Hava girişindeki hazne ısıtıcısının sıcaklık sensöründe kısa devre olabilir."
        },
        {
            "ecode": "0300920000010007",
            "intro": "Hazne ısıtıcı 2'nin sıcaklığı düzgün değil. Sensörde açık devre olabilir."
        },
        {
            "ecode": "1203200000020003",
            "intro": "AMS4 Yuva1 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "1202330000020002",
            "intro": "AMS3 Yuva4 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1201210000020006",
            "intro": "AMS2 Yuva2 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0703330000020002",
            "intro": "AMS4 Yuva4 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1200450000020001",
            "intro": "Filament kesici sensörü arızalı. Lütfen konektörün düzgün takılıp takılmadığını kontrol edin."
        },
        {
            "ecode": "1203300000030003",
            "intro": "AMS4 Yuva1 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0703500000020001",
            "intro": "AMS4 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "0C00020000020002",
            "intro": "Yatay lazer çizgisi çok geniş. Lütfen ısı yatağının kirli olup olmadığını kontrol edin."
        },
        {
            "ecode": "0500030000020014",
            "intro": "bbl_screen bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "0703230000020004",
            "intro": "AMS4 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0703230000030002",
            "intro": "AMS4 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1200120000010001",
            "intro": "AMS1 Yuva3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1200330000010001",
            "intro": "AMS1 Yuva4 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1201230000020003",
            "intro": "AMS2 Yuva4 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0500020000020006",
            "intro": "Liveview hizmeti arızalı; lütfen ağ bağlantınızı kontrol edin."
        },
        {
            "ecode": "1200200000020005",
            "intro": "AMS1 Yuva1 filamenti tükendi ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1202330000030003",
            "intro": "AMS3 Yuva4 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0700010000010003",
            "intro": "AMS1 yardımcı motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1201300000010004",
            "intro": "AMS2'deki bir şifreleme çipi arızası nedeniyle RFID okunamıyor."
        },
        {
            "ecode": "1202210000020005",
            "intro": "AMS3 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1201720000010001",
            "intro": "AMS2 Filament hızı ve uzunluğu hatası: Yuva 3 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0300130000010001",
            "intro": "Motor-A'nın akım sensörü düzgün değil. Bunun nedeni donanım örnekleme devresindeki bir arıza olabilir."
        },
        {
            "ecode": "0500030000010003",
            "intro": "AMS modülü arızalı. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "1203330000020002",
            "intro": "AMS4 Yuva4 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0701210000030002",
            "intro": "AMS2 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "03000C0000010001",
            "intro": "Isı yatağı kuvvet sensörü 3 çok hassas. Germe kolu ile ısı yatağı desteği arasına sıkışmış olabilir veya ayar vidası çok sıkı olabilir."
        },
        {
            "ecode": "0702010000020002",
            "intro": "AMS3 yardımcı motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1201210000020001",
            "intro": "AMS2 Yuva2 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0300940000020003",
            "intro": "Hazne istenen sıcaklığa ulaşamadı. Makine hazne sıcaklığını beklemeyi bırakacaktır."
        },
        {
            "ecode": "1202210000020006",
            "intro": "AMS3 Yuva2 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1201820000020001",
            "intro": "AMS2 Yuva3 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1201730000010001",
            "intro": "AMS2 Filament hızı ve uzunluğu hatası: Yuva 4 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1202320000030003",
            "intro": "AMS3 Yuva3 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0702230000020004",
            "intro": "AMS3 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0703100000020002",
            "intro": "AMS4 slot1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700400000020002",
            "intro": "Filament tampon konum sinyali hatası: konum sensörü arızalı olabilir."
        },
        {
            "ecode": "03000C0000010005",
            "intro": "Kuvvet sensörü 3 beklenmedik sürekli kuvvet algıladı. Isı yatağı sıkışmış veya analog ön uç kırılmış olabilir."
        },
        {
            "ecode": "0500020000020004",
            "intro": "Yetkisiz kullanıcı: lütfen hesap bilgilerinizi kontrol edin."
        },
        {
            "ecode": "0300140000010001",
            "intro": "Motor-B'nin akım sensörü düzgün değil. Bunun nedeni donanım örnekleme devresindeki bir arıza olabilir."
        },
        {
            "ecode": "0702230000020003",
            "intro": "AMS3 Slot4'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1201300000030003",
            "intro": "AMS2 Yuva1 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0300200000010001",
            "intro": "X ekseni sıfırlanması düzgün değil: lütfen takım kafasının sıkışıp sıkışmadığını veya karbon çubuğun çok fazla dirence sahip olup olmadığını kontrol edin."
        },
        {
            "ecode": "0703230000020003",
            "intro": "AMS4 Slot4'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0701300000010001",
            "intro": "AMS2 Yuva1 ve Yuva2 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0702110000010001",
            "intro": "AMS3 yuva2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0700630000020001",
            "intro": "AMS1 yuvası4 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0702620000020001",
            "intro": "AMS3 yuvası3 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1200130000020002",
            "intro": "AMS1 Yuva4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1203230000030002",
            "intro": "AMS4 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1200310000010001",
            "intro": "AMS1 Yuva2 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0703200000020004",
            "intro": "AMS4 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1202200000020004",
            "intro": "AMS3 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1203130000020002",
            "intro": "AMS4 Yuva4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1203230000020003",
            "intro": "AMS4 Yuva4 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "03000D0000010006",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "0702010000010003",
            "intro": "AMS3 yardımcı motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0701310000010001",
            "intro": "AMS2 Yuva3 ve Yuva4 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0700300000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "1201230000030001",
            "intro": "AMS2 Yuva4 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "1200130000010003",
            "intro": "AMS1 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0703210000030002",
            "intro": "AMS4 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700010000010001",
            "intro": "AMS1 yardımcı motoru kaymıştır. Ekstrüzyon çarkı aşınmış olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0500010000020003",
            "intro": "USB kamera arızalı."
        },
        {
            "ecode": "1200230000030001",
            "intro": "AMS1 Yuva4 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0300060000010003",
            "intro": "Motor-A'nın direnci düzgün değil, motor arızalanmış olabilir."
        },
        {
            "ecode": "1202230000020006",
            "intro": "AMS3 Yuva4 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1202220000020002",
            "intro": "AMS3 Yuva3 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0701630000020001",
            "intro": "AMS2 yuvası4 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0C00020000020007",
            "intro": "Dikey lazer yanmıyor. Lütfen kapalı olup olmadığını veya donanım bağlantısının normal olup olmadığını kontrol edin."
        },
        {
            "ecode": "1202210000020001",
            "intro": "AMS3 Yuva2 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0701220000020002",
            "intro": "AMS2 Yuva3 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0700400000020003",
            "intro": "AMS Hub iletişimi düzgün değil, kablo iyi bağlanmamış olabilir."
        },
        {
            "ecode": "0702210000020002",
            "intro": "AMS3 Yuva2 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "1203130000010003",
            "intro": "AMS4 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0701120000010001",
            "intro": "AMS2 slot3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0300070000010002",
            "intro": "Motor-B'de kısa devre var. Arızalanmış olabilir."
        },
        {
            "ecode": "0500030000010009",
            "intro": "Bir sistem kilitlenmesi meydana geldi. Otomatik yeniden başlatma ile kurtarıldı."
        },
        {
            "ecode": "0500040000020014",
            "intro": "AMS2 Yuva1 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0702630000020001",
            "intro": "AMS3 yuvası4 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1203730000010001",
            "intro": "AMS4 Filament hızı ve uzunluğu hatası: Yuva 4 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1201330000030003",
            "intro": "AMS2 Yuva4 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0300080000010001",
            "intro": "Motor-Z'de açık devre var. Bağlantı gevşek olabilir veya motor arızalanmış olabilir."
        },
        {
            "ecode": "0500030000020020",
            "intro": "Micro SD Kart kapasitesi yazdırma dosyalarını önbelleğe almak için yetersiz."
        },
        {
            "ecode": "1200200000020002",
            "intro": "AMS1 Yuva1 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0700220000020005",
            "intro": "AMS1 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0703120000010001",
            "intro": "AMS4 slot3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0C00010000010003",
            "intro": "Mikro Lidar kamera ve MCU arasındaki senkronizasyon düzgün değil. Lütfen yazıcınızı yeniden başlatın."
        },
        {
            "ecode": "0702230000020005",
            "intro": "AMS3 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1203830000020001",
            "intro": "AMS4 Yuva4 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0703020000010001",
            "intro": "AMS4 Filament hızı ve uzunluğu hatası: Filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0500030000020017",
            "intro": "kayıt cihazı bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "1203200000030002",
            "intro": "AMS4 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0701300000020002",
            "intro": "AMS2 Yuva1 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0702100000010001",
            "intro": "AMS3 slot1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0702200000020001",
            "intro": "AMS3 Yuva1 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202710000010001",
            "intro": "AMS3 Filament hızı ve uzunluğu hatası: Yuva 2 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0300910000010007",
            "intro": "Hazne ısıtıcı 1'nin sıcaklığı düzgün değil. Sensörde açık devre olabilir."
        },
        {
            "ecode": "1203220000020005",
            "intro": "AMS4 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "03000D000001000B",
            "intro": "Z ekseni motoru hareket ederken sıkışmış gibi görünüyor. Lütfen Z sürgüleri veya Z triger kayışı tekerlekleri üzerinde herhangi bir yabancı madde olup olmadığını kontrol edin."
        },
        {
            "ecode": "1202800000020001",
            "intro": "AMS3 Yuva1 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701220000020005",
            "intro": "AMS2 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0702310000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0703310000020002",
            "intro": "AMS4 Yuva2 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0C00030000030006",
            "intro": "Temizlenmiş filament fazla kanalda birikmiş olabilir. Lütfen fazla oluğu kontrol edin ve temizleyin."
        },
        {
            "ecode": "0300910000010008",
            "intro": "Hazne ısıtıcı 1 hedef sıcaklığa yükselemedi."
        },
        {
            "ecode": "07FF200000020004",
            "intro": "Lütfen harici filamenti ekstrüderden çekin."
        },
        {
            "ecode": "0500040000030008",
            "intro": "Kapının açık olduğu tespit edildi."
        },
        {
            "ecode": "0701100000010003",
            "intro": "AMS2 yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0703620000020001",
            "intro": "AMS4 yuvası3 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0703300000010001",
            "intro": "AMS4 Yuva1 ve Yuva2 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0703200000030002",
            "intro": "AMS4 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1203220000030002",
            "intro": "AMS4 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700210000020003",
            "intro": "AMS1 Slot2'nin filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0500030000010006",
            "intro": "Bir sistem paniği meydana geldi. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "0500050000030002",
            "intro": "Cihaz mühendislik durumundadır, lütfen bilgi güvenliği ile ilgili konulara dikkat edin."
        },
        {
            "ecode": "1200220000020005",
            "intro": "AMS1 Yuva3 filamenti tükendi ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0702100000010003",
            "intro": "AMS3 yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1201220000020006",
            "intro": "AMS2 Yuva3 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0300020000010002",
            "intro": "Nozul sıcaklığı düzgün değil; ısıtıcıda açık devre olabilir."
        },
        {
            "ecode": "1200310000020002",
            "intro": "AMS1 Yuva2 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0300060000010001",
            "intro": "Motor-A'da açık devre var. Gevşek bir bağlantı olabilir veya motor arızalanmış olabilir."
        },
        {
            "ecode": "0C00020000020003",
            "intro": "Yatay lazer, hedefleme konumunda yeterince parlak değil. Bu mesaj tekrar tekrar görünürse lütfen ısı yatağını temizleyin veya değiştirin."
        },
        {
            "ecode": "0500030000020011",
            "intro": "bellek dökümü güncelleniyor, kurtarılıyor."
        },
        {
            "ecode": "1201220000020005",
            "intro": "AMS2 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0701220000020004",
            "intro": "AMS2 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "050003000002000C",
            "intro": "Kablosuz donanım hatası: lütfen WiFi'yi kapatın/açın veya cihazı yeniden başlatın."
        },
        {
            "ecode": "0703300000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "1203300000010001",
            "intro": "AMS4 Yuva1 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0500020000020001",
            "intro": "İnternete bağlanılamadı. Lütfen ağ bağlantısını kontrol edin."
        },
        {
            "ecode": "0300930000010004",
            "intro": "Hazne sıcaklığı düzgün değil. Hava çıkışındaki hazne ısıtıcısının sıcaklık sensöründe açık devre olabilir."
        },
        {
            "ecode": "0702600000020001",
            "intro": "AMS3 yuva1 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0700010000010004",
            "intro": "AMS1 yardımcı motor hız kontrolü arızalı. Hız sensörü arızalı olabilir."
        },
        {
            "ecode": "050004000002001B",
            "intro": "AMS3 Yuva4 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0703010000010003",
            "intro": "AMS4 yardımcı motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300920000010001",
            "intro": "Hazne ısıtıcısı 2'nin sıcaklığı düzgün değil. Isıtıcıda kısa devre olabilir."
        },
        {
            "ecode": "1200230000020005",
            "intro": "AMS1 Yuva4 filamenti tükendi ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0701200000020003",
            "intro": "AMS2 Slot1'in filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0702220000030001",
            "intro": "AMS3 Yuva3 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0701220000020003",
            "intro": "AMS2 Slot3'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1200210000020002",
            "intro": "AMS1 Yuva2 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703310000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "0701200000030002",
            "intro": "AMS2 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "12FF200000020006",
            "intro": "Filament ekstrüde edilemedi ve ekstrüder tıkanmış olabilir."
        },
        {
            "ecode": "0700220000030001",
            "intro": "AMS1 Yuva3 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0500040000020010",
            "intro": "AMS1 Yuva1 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1202200000020003",
            "intro": "AMS3 Yuva1 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "1203810000020001",
            "intro": "AMS4 Yuva2 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700210000030001",
            "intro": "AMS1 Yuva2 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0701230000020001",
            "intro": "AMS2 Yuva4 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0701330000020002",
            "intro": "AMS2 Yuva4 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0500030000010004",
            "intro": "AHB modülü arızalı. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "0300030000010001",
            "intro": "Nozul fanının hızı çok yavaş veya durmuş. Sıkışmış veya konektör düzgün takılmamış olabilir."
        },
        {
            "ecode": "0C00030000020004",
            "intro": "Geçerli yazdırma işi için ilk katman denetimi desteklenmiyor."
        },
        {
            "ecode": "1200300000030003",
            "intro": "AMS1 Yuva1 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "12FF200000030007",
            "intro": "Tüm AMS yuvalarının filament konumu kontrol ediliyor, lütfen bekleyin."
        },
        {
            "ecode": "1202300000020002",
            "intro": "AMS3 Yuva1 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1201800000020001",
            "intro": "AMS2 Yuva1 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "030001000001000A",
            "intro": "Sıcak yatak sıcaklık kontrolü düzgün değil, AC kartı bozulmuş olabilir."
        },
        {
            "ecode": "1202210000020002",
            "intro": "AMS3 Yuva2 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202200000020006",
            "intro": "AMS3 Yuva1 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1200230000020003",
            "intro": "AMS1 Yuva4 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0500030000030007",
            "intro": "Bir sistem paniği meydana geldi. Otomatik yeniden başlatma ile kurtarıldı."
        },
        {
            "ecode": "0700010000020002",
            "intro": "AMS1 yardımcı motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300010000030008",
            "intro": "Isıtmalı yatağın sıcaklığı limiti aşar ve otomatik olarak limit sıcaklığa ayarlanır."
        },
        {
            "ecode": "1203230000030001",
            "intro": "AMS4 Yuva4 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0700210000020004",
            "intro": "AMS1 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "030091000001000A",
            "intro": "Kabin ısıtıcı 1'in sıcaklığı düzgün değil. AC kartı bozulmuş olabilir."
        },
        {
            "ecode": "0500020000020003",
            "intro": "İnternete bağlanılamadı; lütfen ağ bağlantısını kontrol edin."
        },
        {
            "ecode": "0702200000030002",
            "intro": "AMS3 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1200120000010003",
            "intro": "AMS1 Yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "12FF200000020007",
            "intro": "Takım kafasındaki filament konumu kontrol edilemedi; daha fazla yardım için lütfen tıklayın."
        },
        {
            "ecode": "1201210000020005",
            "intro": "AMS2 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700210000020002",
            "intro": "AMS1 Yuva2 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0701320000020002",
            "intro": "AMS2 Yuva3 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1202330000010001",
            "intro": "AMS3 Yuva4 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0703310000010001",
            "intro": "AMS4 Yuva3 ve Yuva4 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0700210000020001",
            "intro": "AMS1 Yuva2 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0702010000010001",
            "intro": "AMS3 yardımcı motoru kaymıştır. Ekstrüzyon çarkı aşınmış olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1200210000030002",
            "intro": "AMS1 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1203200000020005",
            "intro": "AMS4 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0701230000030002",
            "intro": "AMS2 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1203120000010001",
            "intro": "AMS4 Yuva3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0700310000020002",
            "intro": "AMS1 Yuva2 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1201300000020002",
            "intro": "AMS2 Yuva1 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1201120000020002",
            "intro": "AMS2 Yuva3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701310000020002",
            "intro": "AMS2 Yuva2 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0700620000020001",
            "intro": "AMS1 slot3 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0300200000010002",
            "intro": "Y ekseni sıfırlanması düzgün değil: lütfen takım kafasının sıkışıp sıkışmadığını veya Y taşıyıcısının çok fazla dirence sahip olup olmadığını kontrol edin."
        },
        {
            "ecode": "1203220000030001",
            "intro": "AMS4 Yuva3 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "1200230000020004",
            "intro": "AMS1 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1201310000010001",
            "intro": "AMS2 Yuva2 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1203210000020005",
            "intro": "AMS4 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti ; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700200000020001",
            "intro": "AMS1 Yuva1 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0701130000010001",
            "intro": "AMS2 slot4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0702300000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "1201200000020005",
            "intro": "AMS2 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1200110000010003",
            "intro": "AMS1 Yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300070000010001",
            "intro": "Motor-B'de açık devre var. Bağlantı gevşek olabilir veya motor arızalanmış olabilir."
        },
        {
            "ecode": "1203310000010001",
            "intro": "AMS4 Yuva2 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1201220000020003",
            "intro": "AMS2 Yuva3 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0702120000010003",
            "intro": "The AMS3 slot3 motor torque control is malfunctioning. The current sensor may be faulty."
        },
        {
            "ecode": "0500030000020010",
            "intro": "ileri yönlü bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "1202300000010004",
            "intro": "AMS3'teki bir şifreleme çipi arızası nedeniyle RFID okunamıyor."
        },
        {
            "ecode": "1200330000020002",
            "intro": "AMS1 Yuva4 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0500030000020012",
            "intro": "ip kamera bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "050004000002001E",
            "intro": "AMS4 Yuva3 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1203210000030002",
            "intro": "AMS4 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1201220000020004",
            "intro": "AMS2 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0C0003000001000A",
            "intro": "Yazıcınız fabrika modunda. Lütfen Teknik Destek ile iletişime geçin."
        },
        {
            "ecode": "03000D0000010007",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "1201230000020005",
            "intro": "AMS2 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1200700000010001",
            "intro": "AMS1 Filament hızı ve uzunluğu hatası: Yuva 1 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "03001B0000010003",
            "intro": "Isı yatağı hızlanma sensörü beklenmedik sürekli kuvvet algıladı. Sensör sıkışmış veya analog ön uç bozulmuş olabilir."
        },
        {
            "ecode": "0300150000010001",
            "intro": "Motor-Z'nin akım sensörü düzgün değil. Bunun nedeni donanım örnekleme devresindeki bir arıza olabilir."
        },
        {
            "ecode": "0C00010000010005",
            "intro": "Mikro Lidar kamera OTP parametresi düzgün değil. Lütfen satış sonrası ile iletişime geçin."
        },
        {
            "ecode": "0500010000030005",
            "intro": "MicroSD Kart hatası: lütfen yeniden takın, biçimlendirin veya değiştirin."
        },
        {
            "ecode": "0700110000010001",
            "intro": "AMS1 slot2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "03000D0000010004",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "1201200000020002",
            "intro": "AMS2 Yuva1 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1201210000020002",
            "intro": "AMS2 Yuva2 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202830000020001",
            "intro": "AMS3 Yuva4 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1202120000010001",
            "intro": "AMS3 Yuva3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1202100000010001",
            "intro": "AMS3 Yuva1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0702210000020004",
            "intro": "AMS3 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1203220000020002",
            "intro": "AMS4 Yuva3 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0500020000020007",
            "intro": "Liveview hizmetinde oturum açma başarısız oldu; lütfen ağ bağlantınızı kontrol edin."
        },
        {
            "ecode": "0703100000010003",
            "intro": "AMS4 yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300910000010006",
            "intro": "Hazne ısıtıcı 1'in sıcaklığı düzgün değil. Sensörde kısa devre olabilir."
        },
        {
            "ecode": "0300120000020001",
            "intro": "Alet kafasının ön kapağı düştü."
        },
        {
            "ecode": "1203320000020002",
            "intro": "AMS4 Yuva3 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1202310000030003",
            "intro": "AMS3 Yuva2 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1200320000010001",
            "intro": "AMS1 Yuva3 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1202120000020002",
            "intro": "AMS3 Yuva3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701220000030002",
            "intro": "AMS2 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0300940000030001",
            "intro": "Hazne soğutması çok yavaş olabilir. Haznedeki gaz toksik değilse soğumaya yardımcı olmak için hazneyi açabilirsiniz."
        },
        {
            "ecode": "1200300000010001",
            "intro": "AMS1 Yuva1 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0701230000020002",
            "intro": "AMS2 Yuva4 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "1202130000010003",
            "intro": "AMS3 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0702220000020002",
            "intro": "AMS3 Yuva3 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0703230000030001",
            "intro": "AMS4 Yuva4 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "1201330000020002",
            "intro": "AMS2 Yuva4 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1200300000010004",
            "intro": "AMS1'deki bir şifreleme çipi arızası nedeniyle RFID okunamıyor."
        },
        {
            "ecode": "0703350000010001",
            "intro": "Sıcaklık ve nem sensöründe bir hata var. Çip arızalı olabilir."
        },
        {
            "ecode": "1201200000030002",
            "intro": "AMS2 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0701500000020001",
            "intro": "AMS2 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "0300190000010001",
            "intro": "Y eksenindeki girdap akımı sensörü mevcut değildir, kablo kopmuş olmalıdır."
        },
        {
            "ecode": "0702200000020005",
            "intro": "AMS3 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1201830000020001",
            "intro": "AMS2 Yuva4 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300070000010003",
            "intro": "Motor-B'nin direnci düzgün değil, motor arızalanmış olabilir."
        },
        {
            "ecode": "0500040000020020",
            "intro": ""
        },
        {
            "ecode": "1203300000010004",
            "intro": "AMS4'teki bir şifreleme çipi arızası nedeniyle RFID okunamıyor."
        },
        {
            "ecode": "0300100000020001",
            "intro": "X ekseninin rezonans frekansı düşük. Triger kayışı gevşek olabilir."
        },
        {
            "ecode": "1200210000020005",
            "intro": "AMS1 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0702220000020003",
            "intro": "AMS3 Slot3'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1200510000030001",
            "intro": "AMS devre dışı; lütfen filamenti makara tutucudan yükleyin."
        },
        {
            "ecode": "0700300000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0300940000030002",
            "intro": "Oda sıcaklığı ayar değeri sınırı aştığında, sınır değer ayarlanacaktır."
        },
        {
            "ecode": "1200220000020001",
            "intro": "AMS1 Yuva3 filamenti bitti; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0702300000020002",
            "intro": "AMS3 Yuva1 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "03000C0000010003",
            "intro": "Isı yatağı kuvvet sensörü 3'ün sinyali çok zayıf. Sensöre giden elektronik bağlantı kopmuş olabilir."
        },
        {
            "ecode": "1201120000010003",
            "intro": "AMS2 Yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0500030000020018",
            "intro": "güvenlik bellek dökümü, kurtarılıyor."
        },
        {
            "ecode": "0702200000020004",
            "intro": "AMS3 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0700200000020005",
            "intro": "AMS1 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700200000020003",
            "intro": "AMS1 Slot1'in filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0703010000010004",
            "intro": "AMS4 yardımcı motor hız kontrolü arızalı. Hız sensörü arızalı olabilir."
        },
        {
            "ecode": "0701300000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0700200000020004",
            "intro": "AMS1 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "03000D0000010002",
            "intro": "Isı yatağı hedef arama başarısız oldu. Çevresel titreşim çok büyük."
        },
        {
            "ecode": "1203230000020004",
            "intro": "AMS4 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0701230000020003",
            "intro": "AMS2 Slot4'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0500040000020007",
            "intro": "Yatak sıcaklığı filamentin yumşama sıcaklığını aşıyor, bu da nozül tıkanmasına neden olabilir. Lütfen yazıcının ön kapağını açık tutun veya yatak sıcaklığını düşürün."
        },
        {
            "ecode": "1200710000010001",
            "intro": "AMS1 Filament hızı ve uzunluğu hatası: Yuva 2 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1203200000020006",
            "intro": "AMS4 Yuva1 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1203220000020004",
            "intro": "AMS4 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0500040000010002",
            "intro": "Yazdırma durumu bildirilemedi. Lütfen ağ bağlantınızı kontrol edin."
        },
        {
            "ecode": "1201220000020002",
            "intro": "AMS2 Yuva3 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703010000020002",
            "intro": "AMS4 yardımcı motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700600000020001",
            "intro": "AMS1 yuva1 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1203320000010001",
            "intro": "AMS4 Yuva3 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0300900000010002",
            "intro": "Hazne ısıtması başarısız oldu. Hazne kapalı olmayabilir veya ortam sıcaklığı çok düşük olabilir ya da güç kaynağının ısı dağıtma deliği tıkalı olabilir."
        },
        {
            "ecode": "0703220000020004",
            "intro": "AMS4 Yuva3 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0701230000030001",
            "intro": "AMS2 Yuva4 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0300090000010002",
            "intro": "Motor-E'de kısa devre var. Arızalanmış olabilir."
        },
        {
            "ecode": "0300930000010001",
            "intro": "Hazne sıcaklığı düzgün değil. Hazne ısıtıcısının sıcaklık sensöründe kısa devre olabilir."
        },
        {
            "ecode": "03000D0000020001",
            "intro": "Isı yatağı sıfırlanması düzgün değil: ısı yatağında bir çıkıntı olabilir veya nozül ucu temiz olmayabilir."
        },
        {
            "ecode": "0300900000010004",
            "intro": "Hazne ısıtması başarısız oldu. Isıtma fanının hızı çok düşük."
        },
        {
            "ecode": "0700330000020002",
            "intro": "AMS1 Yuva4 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0702230000020001",
            "intro": "AMS3 Yuva4 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703630000020001",
            "intro": "AMS4 yuvası4 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "12FF200000020001",
            "intro": "Makara tutucudaki filament bitmiştir; lütfen yeni bir filament takın."
        },
        {
            "ecode": "0C0001000001000B",
            "intro": "Mikro Lidar kalibre edilemedi. Lütfen kalibrasyon grafiğinin temiz olduğundan ve tıkalı olmadığından emin olun ve makine kalibrasyonunu tekrar çalıştırın."
        },
        {
            "ecode": "1202210000020003",
            "intro": "AMS3 Yuva2 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0300080000010003",
            "intro": "Motor-Z'nin direnci düzgün değil, motor arızalanmış olabilir."
        },
        {
            "ecode": "1200210000020001",
            "intro": "AMS1 Yuva2 filamenti tükendi; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703220000030001",
            "intro": "AMS4 Yuva3 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0703200000020002",
            "intro": "AMS4 Yuva1 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0300930000010002",
            "intro": "Hazne sıcaklığı düzgün değil. Hazne ısıtıcısının sıcaklık sensöründe açık devre olabilir."
        },
        {
            "ecode": "1201210000020003",
            "intro": "AMS2 Yuva2 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0500030000010002",
            "intro": "Takım kafası arızalı. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "0702210000020001",
            "intro": "AMS3 Yuva2 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202300000030003",
            "intro": "AMS3 Yuva1 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0C00010000010004",
            "intro": "Mikro Lidar kamera lensi kirli görünüyor. Lütfen lensi temizleyin."
        },
        {
            "ecode": "0703210000020005",
            "intro": "AMS4 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0300010000010003",
            "intro": "Isı yatağı sıcaklığı düzgün değil; ısıtıcı aşırı sıcak."
        },
        {
            "ecode": "0300020000010009",
            "intro": "Nozul sıcaklık kontrolü düzgün değil; sıcak uç takılı olmayabilir. Sıcak ucu takılı olmadan ısıtmak istiyorsanız, lütfen ayarlar sayfasından bakım modunu açın."
        },
        {
            "ecode": "1202110000010001",
            "intro": "AMS4 Yuva2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0700230000020005",
            "intro": "AMS1 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700310000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1200220000030001",
            "intro": "AMS1 Yuva3 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0700230000020003",
            "intro": "AMS1 Slot4'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "0703230000020005",
            "intro": "AMS4 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700220000030002",
            "intro": "AMS1 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0300170000020002",
            "intro": "Nozul fanının hızı yavaş. Sıkışmış ve temizlenmesi gerekiyor olabilir."
        },
        {
            "ecode": "0700400000020004",
            "intro": "Filament tampon sinyali düzgün değil; yay sıkışmış olabilir veya filament dolaşmış olabilir."
        },
        {
            "ecode": "0700510000030001",
            "intro": "AMS devre dışı; lütfen filamenti makara tutucudan yükleyin."
        },
        {
            "ecode": "1203310000030003",
            "intro": "AMS4 Yuva2 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0300410000010001",
            "intro": "Sistem voltajı dengesiz; güç kesintisi koruma fonksiyonunu tetikliyor."
        },
        {
            "ecode": "0C0003000002000F",
            "intro": "İlk katman denetiminden önce atlanan parçalar, denetim mevcut baskı için desteklenmeyecektir."
        },
        {
            "ecode": "1202820000020001",
            "intro": "AMS3 Yuva3 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1201130000020002",
            "intro": "AMS2 Yuva4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1202110000010003",
            "intro": "AMS3 Yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1203210000030001",
            "intro": "AMS4 Yuva2 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "1201130000010003",
            "intro": "AMS2 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1200210000020004",
            "intro": "AMS1 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0702200000020003",
            "intro": "AMS3 Slot1'in filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1203230000020006",
            "intro": "AMS4 Yuva4 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0702200000020002",
            "intro": "AMS3 Yuva1 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0703610000020001",
            "intro": "AMS4 slot2 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1200720000010001",
            "intro": "AMS1 Filament hızı ve uzunluğu hatası: Yuva 3 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1203500000020001",
            "intro": "AMS4 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "1201200000020006",
            "intro": "AMS2 Yuva1 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0500040000010001",
            "intro": "Yazdırma işi indirilemedi. Lütfen ağ bağlantınızı kontrol edin."
        },
        {
            "ecode": "0500040000020017",
            "intro": "AMS2 Yuva4 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0703310000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0500040000010006",
            "intro": "Önceki yazdırmaya devam edilemedi."
        },
        {
            "ecode": "03000A0000010002",
            "intro": "Isı yatağı kuvvet sensörü 1'in sinyali zayıf. Kuvvet sensörü kırılmış veya elektrik bağlantısı zayıf olabilir."
        },
        {
            "ecode": "1200300000020002",
            "intro": "AMS1 Yuva1 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0500020000020005",
            "intro": "İnternete bağlanılamadı; lütfen ağ bağlantısını kontrol edin."
        },
        {
            "ecode": "1202220000020006",
            "intro": "AMS3 Yuva3 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1200110000010001",
            "intro": "AMS1 Yuva2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1200210000020006",
            "intro": "AMS1 Yuva2 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "1201120000010001",
            "intro": "AMS2 Yuva3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "03000D0000010008",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "0C00020000020008",
            "intro": "Dikey lazer çizgisi çok geniş. Lütfen ısı yatağının kirli olup olmadığını kontrol edin."
        },
        {
            "ecode": "0703220000020001",
            "intro": "AMS4 Yuva3 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1200200000030002",
            "intro": "AMS1 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0300060000010002",
            "intro": "Motor-A'da kısa devre var. Arızalanmış olabilir."
        },
        {
            "ecode": "0700300000020002",
            "intro": "AMS1 Yuva1 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "1203230000020002",
            "intro": "AMS4 Yuva4 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202220000020003",
            "intro": "AMS3 Yuva3 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0702210000030001",
            "intro": "AMS3 Yuva2 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0300920000010002",
            "intro": "Hazne ısıtıcısı 2'nin sıcaklığı düzgün değil. Isıtıcıda açık devre olabilir veya termal sigorta devrede olabilir."
        },
        {
            "ecode": "0703600000020001",
            "intro": "AMS4 yuva1 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0C00030000030007",
            "intro": "Olası ilk katman kusurları tespit edildi. Lütfen ilk katman kalitesini kontrol edin ve işin durdurulup durdurulmayacağına karar verin."
        },
        {
            "ecode": "0702350000010001",
            "intro": "Sıcaklık ve nem sensöründe bir hata var. Çip arızalı olabilir."
        },
        {
            "ecode": "0703110000010001",
            "intro": "AMS4 slot2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "03001A0000020002",
            "intro": "Nozül filament ile tıkanmış."
        },
        {
            "ecode": "1202320000010001",
            "intro": "AMS3 Yuva3 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0703210000030001",
            "intro": "AMS4 Yuva2 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0701350000010001",
            "intro": "Sıcaklık ve nem sensöründe bir hata var. Çip arızalı olabilir."
        },
        {
            "ecode": "07FF200000020001",
            "intro": "Harici filament bitti; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0500040000010003",
            "intro": "Yazdırma dosyasının içeriği okunamıyor. Lütfen yazdırma işini yeniden gönderin."
        },
        {
            "ecode": "0703220000020005",
            "intro": "AMS4 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1202320000020002",
            "intro": "AMS3 Yuva3 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0500010000030004",
            "intro": "MicroSD Kartta yeterli alan yok, lütfen biraz yer açın."
        },
        {
            "ecode": "1201710000010001",
            "intro": "AMS2 Filament hızı ve uzunluğu hatası: Yuva 2 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0300190000020002",
            "intro": "Y ekseni girdap akımı sensörünün hassasiyeti çok düşük."
        },
        {
            "ecode": "0C00020000020004",
            "intro": "Nozul yüksekliği çok düşük görünüyor. Lütfen nozulun aşınmış veya eğilmiş olup olmadığını kontrol edin. Nozul değiştirilmişse Lidar'ı yeniden kalibre edin."
        },
        {
            "ecode": "0702610000020001",
            "intro": "AMS3 yuva2 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0700220000020003",
            "intro": "AMS1 Slot3'ün filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1200450000020002",
            "intro": "Filament kesicinin kesme mesafesi çok büyük. X motoru adımları kaybedebilir."
        },
        {
            "ecode": "0702130000020002",
            "intro": "AMS3 slot4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300010000010001",
            "intro": "Isı yatağı sıcaklığı düzgün değil; ısıtıcıda kısa devre olabilir."
        },
        {
            "ecode": "0703200000020005",
            "intro": "AMS4 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700200000030001",
            "intro": "AMS1 Yuva1 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "0300180000010001",
            "intro": "Ekstrüzyon kuvveti sensörünün değeri düşük, nozul takılmamış gibi görünüyor."
        },
        {
            "ecode": "1200200000020003",
            "intro": "AMS1 Yuva1 filamenti PTFE tüpünde kırılmış olabilir."
        },
        {
            "ecode": "0702220000020005",
            "intro": "AMS3 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "03000D000001000A",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "1201810000020001",
            "intro": "AMS2 Yuva2 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1200320000030003",
            "intro": "AMS1 Yuva3 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "12FF200000020002",
            "intro": "Makara tutucusundaki filament boş; lütfen yeni bir filament takın."
        },
        {
            "ecode": "1200240000020001",
            "intro": "Filament, takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1203100000010003",
            "intro": "AMS4 Yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0C00030000010009",
            "intro": "Birinci katman denetim modülü düzgün olmayan şekilde yeniden başlatıldı. Denetim sonucu hatalı olabilir."
        },
        {
            "ecode": "0700110000010003",
            "intro": "AMS1 yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0702120000010001",
            "intro": "AMS3 slot3 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0500010000030007",
            "intro": "MicroSD kart takılı olmadan hızlandırılmış fotoğraf kaydedilemiyor."
        },
        {
            "ecode": "03000B0000010001",
            "intro": "Isı yatağı kuvvet sensörü 2 çok hassas. Germe kolu ile ısı yatağı desteği arasına sıkışmış olabilir veya ayar vidası çok sıkı olabilir."
        },
        {
            "ecode": "1202310000020002",
            "intro": "AMS3 Yuva2 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1201100000010001",
            "intro": "AMS2 Yuva1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0701110000020002",
            "intro": "AMS2 slot2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0702010000010004",
            "intro": "AMS3 yardımcı motor hız kontrolü arızalı. Hız sensörü arızalı olabilir."
        },
        {
            "ecode": "1201200000030001",
            "intro": "AMS2 Yuva1 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0700210000030002",
            "intro": "AMS1 Yuva2 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0702200000030001",
            "intro": "AMS3 Yuva1 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "1203210000020006",
            "intro": "AMS4 Yuva2 filamenti ekstrüde edilemedi; ekstrüder tıkanmış olabilir veya filament çok ince olabilir, bu da ekstrüderin kaymasına neden olabilir."
        },
        {
            "ecode": "0703210000020004",
            "intro": "AMS4 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1202200000020002",
            "intro": "AMS3 Yuva1 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0700130000010001",
            "intro": "AMS1 slot4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203330000010001",
            "intro": "AMS4 Yuva4 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "050004000002001C",
            "intro": "AMS4 Yuva1 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "03000A0000010005",
            "intro": "Kuvvet sensörü 1 beklenmedik sürekli kuvvet algıladı. Isı yatağı sıkışmış veya analog ön uç kırılmış olabilir."
        },
        {
            "ecode": "0500020000020002",
            "intro": "Cihaz girişi başarısız oldu; lütfen hesap bilgilerinizi kontrol edin."
        },
        {
            "ecode": "030092000001000A",
            "intro": "Kabin ısıtıcısı 2'nin sıcaklığı düzgün değil. AC kartı bozulmuş olabilir."
        },
        {
            "ecode": "050003000002000D",
            "intro": "SD Kart denetleyicisi arızalı."
        },
        {
            "ecode": "1201310000020002",
            "intro": "AMS2 Yuva2 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "0701310000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "03000B0000010005",
            "intro": "Kuvvet sensörü 2 beklenmedik sürekli kuvvet algıladı. Isı yatağı sıkışmış veya analog ön uç kırılmış olabilir."
        },
        {
            "ecode": "0703300000020002",
            "intro": "AMS4 Yuva1 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0500040000020018",
            "intro": "AMS3 Yuva1 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1200250000020001",
            "intro": "Filament, takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0700230000020002",
            "intro": "AMS1 Yuva4 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "1201500000020001",
            "intro": "AMS2 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "1000010000020002",
            "intro": "Filamentin gerektirdiği nozul sertliği, yazıcının varsayılan nozul sertliğinden daha yüksektir. Lütfen sertleşmiş nozulu veya filamenti değiştirin, aksi takdirde nozul aşınır veya hasar görür."
        },
        {
            "ecode": "1202310000010001",
            "intro": "AMS3 Yuva2 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "0701210000020004",
            "intro": "AMS2 Yuva2 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1201200000020004",
            "intro": "AMS2 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0702310000010001",
            "intro": "AMS3 Yuva3 & Yuva4 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "1200310000030003",
            "intro": "AMS1 Yuva2 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1202810000020001",
            "intro": "AMS3 Yuva2 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701200000020004",
            "intro": "AMS2 Yuva1 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "1203210000020003",
            "intro": "AMS4 Yuva2 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "03000D0000010003",
            "intro": "Yapı plakası düzgün yerleştirilmemiş. Lütfen ayarlayın."
        },
        {
            "ecode": "0500050000010001",
            "intro": "AP kartının fabrika verileri düzgün değil, lütfen AP kartını yenisiyle değiştirin."
        },
        {
            "ecode": "1000010000020001",
            "intro": "Yatak sıcaklığı filamentin vitrifikasyon sıcaklığını aşıyor. Püskürtme ucunun tıkanmasını önlemek için lütfen yazdırmadan önce yazıcının ön kapısını açın."
        },
        {
            "ecode": "0500040000020013",
            "intro": "AMS1 Yuva4 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "0C00030000020010",
            "intro": "Sıcak yatak üzerinde yabancı cisimler tespit edildi, Lütfen sıcak yatağı kontrol edin ve temizleyin."
        },
        {
            "ecode": "03000C0000010002",
            "intro": "Isı yatağı kuvvet sensörü 3'ün sinyali zayıf. Kuvvet sensörü kırılmış veya elektrik bağlantısı zayıf olabilir."
        },
        {
            "ecode": "0701010000010004",
            "intro": "AMS2 yardımcı motor hız kontrolü arızalı. Hız sensörü arızalı olabilir."
        },
        {
            "ecode": "0702020000010001",
            "intro": "AMS3 Filament hızı ve uzunluğu hatası: Filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0701110000010001",
            "intro": "AMS2 slot2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203110000010001",
            "intro": "AMS4 Yuva2 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0701300000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "12FF200000020004",
            "intro": "Lütfen makara tutucu üzerindeki filamenti ekstrüderden çekin."
        },
        {
            "ecode": "0C00010000010001",
            "intro": "Mikro Lidar kamera çevrimdışı. Lütfen donanım bağlantısını kontrol edin."
        },
        {
            "ecode": "0700100000010003",
            "intro": "AMS1 yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1201300000010001",
            "intro": "AMS2 Yuva1 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1202220000030002",
            "intro": "AMS3 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "1202230000020002",
            "intro": "AMS3 Yuva4 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703100000010001",
            "intro": "AMS4 slot1 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0700120000010003",
            "intro": "AMS1 yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1200230000030002",
            "intro": "AMS1 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0300910000010001",
            "intro": "Hazne ısıtıcısının 1 sıcaklığı düzgün değil. Isıtıcıda kısa devre olabilir."
        },
        {
            "ecode": "0500010000020001",
            "intro": "Medya boru hattı arızalı."
        },
        {
            "ecode": "050003000001000A",
            "intro": "Sistem durumu düzgün değil; lütfen fabrika ayarlarını geri yükleyin."
        },
        {
            "ecode": "0702300000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0702120000020002",
            "intro": "AMS3 yuva3 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "03000F0000010001",
            "intro": "İvmeölçer verileri kullanılamıyor. Alet kafasına olan iletişim bağlantısı kopmuş veya ivmeölçer hasar görmüş olabilir."
        },
        {
            "ecode": "1200800000020001",
            "intro": "AMS1 Yuva1 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0702300000010001",
            "intro": "AMS3 Yuva1 ve Yuva2 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "1201130000010001",
            "intro": "AMS2 Yuva4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0500030000010001",
            "intro": "MC modülü arızalı; lütfen cihazı yeniden başlatın veya cihaz kablo bağlantısını kontrol edin."
        },
        {
            "ecode": "0703220000020002",
            "intro": "AMS4 Yuva3 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "1203110000020002",
            "intro": "AMS4 Yuva2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1200130000010001",
            "intro": "AMS1 Yuva4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0702330000020002",
            "intro": "AMS3 Yuva4 üzerindeki RFID etiketi hasar görmüş veya içeriği tanımlanamıyor."
        },
        {
            "ecode": "0702210000020005",
            "intro": "AMS3 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0300180000010003",
            "intro": "Ekstrüzyon kuvveti sensörü mevcut değil, MC ve TH arasındaki bağlantı kopmuş veya sensör bozulmuş olabilir."
        },
        {
            "ecode": "0702500000020001",
            "intro": "AMS3 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "0700220000020002",
            "intro": "AMS1 Yuva3 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0700230000020004",
            "intro": "AMS1 Yuva4 filamenti takım kafasında kırılmış olabilir."
        },
        {
            "ecode": "0300200000010003",
            "intro": "X ekseni sıfırlanması düzgün değil: triger kayışı gevşek olabilir."
        },
        {
            "ecode": "0700130000010003",
            "intro": "AMS1 yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300180000010002",
            "intro": "Ekstrüzyon kuvveti sensörünün hassasiyeti düşüktür, nozul doğru takılmamış olabilir."
        },
        {
            "ecode": "1202720000010001",
            "intro": "AMS3 Filament hızı ve uzunluğu hatası: Yuva 3 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0701620000020001",
            "intro": "AMS2 yuvası3 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0C0003000003000E",
            "intro": "Yazıcınız ekstrüzyon yapmadan yazdırıyor gibi görünüyor."
        },
        {
            "ecode": "0701210000020003",
            "intro": "AMS2 Slot2'nin filamenti AMS'de kırılmış olabilir."
        },
        {
            "ecode": "1203210000020002",
            "intro": "AMS4 Yuva2 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202230000020005",
            "intro": "AMS3 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0700610000020001",
            "intro": "AMS1 yuva2 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "0702310000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "0703210000020002",
            "intro": "AMS4 Yuva2 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0702130000010001",
            "intro": "AMS3 slot4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1200230000020001",
            "intro": "AMS1 Yuva4 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "1201320000030003",
            "intro": "AMS2 Yuva3 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "1201220000020001",
            "intro": "AMS2 Yuva3 filamenti bitti; lütfen yeni bir filament takın."
        },
        {
            "ecode": "0703120000020002",
            "intro": "AMS4 slot3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300920000010008",
            "intro": "Hazne ısıtıcı 2 hedef sıcaklığa yükselemedi."
        },
        {
            "ecode": "1201100000020002",
            "intro": "AMS2 Yuva1 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701200000020005",
            "intro": "AMS2 Yuva1 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1202130000010001",
            "intro": "AMS3 Yuva4 motoru kaymıştır. Ekstrüzyon çarkı arızalı olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "1203320000030003",
            "intro": "AMS4 Yuva3 RFID yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "050004000002001A",
            "intro": "AMS3 Yuva3 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1201110000010003",
            "intro": "AMS2 Yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "050004000002001D",
            "intro": "AMS4 Yuva2 üzerindeki RFID etiketi tanımlanamıyor."
        },
        {
            "ecode": "1202500000020001",
            "intro": "AMS3 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "0700350000010001",
            "intro": "Sıcaklık ve nem sensöründe bir hata var. Çip arızalı olabilir."
        },
        {
            "ecode": "1202700000010001",
            "intro": "AMS3 Filament hızı ve uzunluğu hatası: Yuva 1 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1200200000030001",
            "intro": "AMS1 Yuva1 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0300090000010003",
            "intro": "Motor-E'nin direnci düzgün değil, motor arızalanmış olabilir."
        },
        {
            "ecode": "0300400000020001",
            "intro": "Seri port üzerinden veri iletimi düzgün değil; yazılım sistemi arızalı olabilir."
        },
        {
            "ecode": "1201100000010003",
            "intro": "AMS2 Yuva1 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1201330000010001",
            "intro": "AMS2 Yuva4 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1202220000020005",
            "intro": "AMS3 Yuva3 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1200320000020002",
            "intro": "AMS1 Yuva3 üzerindeki RFID etiketi hasar görmüş."
        },
        {
            "ecode": "1203110000010003",
            "intro": "AMS4 Yuva2 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0700200000030002",
            "intro": "AMS1 Yuva1 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700130000020002",
            "intro": "AMS1 slot4 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1000010000020003",
            "intro": "Timelapse kayıt işlemi baskı kalitesini etkileyebilir, lütfen etkinleştirip etkinleştirmeyeceğinizi onaylayın."
        },
        {
            "ecode": "0300930000010003",
            "intro": "Hazne sıcaklığı düzgün değil. Hava çıkışındaki hazne ısıtıcısının sıcaklık sensöründe kısa devre olabilir."
        },
        {
            "ecode": "0300020000010006",
            "intro": "Nozul sıcaklığı düzgün değil; sensörde kısa devre olabilir, lütfen konektörün düzgün takılıp takılmadığını kontrol edin."
        },
        {
            "ecode": "0700450000020003",
            "intro": "Filament kesici kolu serbest bırakılmamış. Sap veya bıçak sıkışmış olabilir."
        },
        {
            "ecode": "0701200000020001",
            "intro": "AMS2 Yuva1 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1203700000010001",
            "intro": "AMS4 Filament hızı ve uzunluğu hatası: Yuva 1 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0C0003000003000D",
            "intro": "Bazı nesneler düşmüş olabilir veya ekstrüder normal şekilde ekstrüzyon yapmıyor olabilir. Lütfen kontrol edin ve baskının durdurulup durdurulmayacağına karar verin."
        },
        {
            "ecode": "0C00020000010005",
            "intro": "Yeni bir Mikro Lidar tespit edildi. Lütfen kullanmadan önce Kalibrasyon sayfasından kalibre edin."
        },
        {
            "ecode": "1200230000020002",
            "intro": "AMS1 Yuva4 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0700300000010001",
            "intro": "AMS1 Yuva1 ve Yuva2 arasındaki RFID kartında bir hata var."
        },
        {
            "ecode": "0701010000020002",
            "intro": "AMS2 yardımcı motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1203220000020003",
            "intro": "AMS4 Yuva3 filamenti PTFE tüp içinde kırılabilir."
        },
        {
            "ecode": "0700200000020002",
            "intro": "AMS1 Yuva1 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0702130000010003",
            "intro": "AMS3 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0300110000020002",
            "intro": "Y ekseninin rezonans frekansı son kalibrasyondan büyük ölçüde farklıdır. Lütfen karbon çubuğu temizleyin ve ardından makine kalibrasyonunu yeniden çalıştırın."
        },
        {
            "ecode": "0701610000020001",
            "intro": "AMS2 yuva2 aşırı yüklenmiş. Filament karışmış veya makara sıkışmış olabilir."
        },
        {
            "ecode": "1200210000030001",
            "intro": "AMS1 Yuva2 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0702230000030002",
            "intro": "AMS3 Yuva4 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0700110000020002",
            "intro": "AMS1 slot2 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1202210000030001",
            "intro": "AMS3 Yuva2 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0C00010000010009",
            "intro": "Oda kamerası merceği kirli görünüyor. Lütfen lensi temizleyin."
        },
        {
            "ecode": "0C00010000020006",
            "intro": "Mikro Lidar kamera dış parametreleri düzgün değil. Lütfen bir sonraki baskınızda akış hızı kalibrasyonunu etkinleştirin."
        },
        {
            "ecode": "1203200000030001",
            "intro": "AMS4 Yuva1 filamenti tükendi. Eski filament temizleniyor; lütfen bekleyin."
        },
        {
            "ecode": "0C00030000020005",
            "intro": "İlk katman denetimi düzgün olmayan şekilde zaman aşımına uğradı ve mevcut sonuçlar hatalı olabilir."
        },
        {
            "ecode": "03000B0000010004",
            "intro": "Kuvvet sensörü 2'de harici bir bozulma tespit edildi. Isı yatağı plakası ısı yatağının dışında bir şeye temas etmiş olabilir."
        },
        {
            "ecode": "0703130000010003",
            "intro": "AMS4 Yuva4 motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "0500030000010005",
            "intro": "Dahili servis arızalı. Lütfen cihazı yeniden başlatın."
        },
        {
            "ecode": "1203720000010001",
            "intro": "AMS4 Filament hızı ve uzunluğu hatası: Yuva 3 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "0700120000020002",
            "intro": "AMS1 slot3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "1200500000020001",
            "intro": "AMS1 iletişimi düzgün değil; lütfen bağlantı kablosunu kontrol edin."
        },
        {
            "ecode": "1201220000030002",
            "intro": "AMS2 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0703010000010001",
            "intro": "AMS4 destek motoru kaymıştır. Ekstrüzyon çarkı aşınmış olabilir veya filament çok ince olabilir."
        },
        {
            "ecode": "0300900000010010",
            "intro": "Oda sıcaklığı kontrol cihazının iletişimi düzgün değil."
        },
        {
            "ecode": "0300010000010007",
            "intro": "Isı yatağı sıcaklığı düzgün değil; sensörde açık devre olabilir."
        },
        {
            "ecode": "0300020000010001",
            "intro": "Nozul sıcaklığı düzgün değil; ısıtıcıda kısa devre olabilir."
        },
        {
            "ecode": "1201200000020003",
            "intro": "AMS2 Yuva1 filamenti PTFE tüpünde kırılmış olabilir."
        },
        {
            "ecode": "0300080000010002",
            "intro": "Motor-Z'de kısa devre var. Arızalanmış olabilir."
        },
        {
            "ecode": "0703230000020002",
            "intro": "AMS4 Yuva4 boş; lütfen yeni bir filament yükleyin."
        },
        {
            "ecode": "0700210000020005",
            "intro": "AMS1 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0300910000010003",
            "intro": "Hazne ısıtıcı 1'in sıcaklığı düzgün değil. Isıtıcı aşırı sıcaktır."
        },
        {
            "ecode": "1200830000020001",
            "intro": "AMS1 Yuva4 filamenti karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0701230000020005",
            "intro": "AMS2 Yuva4 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "0701120000020002",
            "intro": "AMS2 slot3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0300170000010001",
            "intro": "Nozul fanının hızı çok yavaş veya durmuş. Sıkışmış olabilir veya konektör düzgün takılmamış olabilir."
        },
        {
            "ecode": "0701220000020001",
            "intro": "AMS2 Yuva3 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0703200000030001",
            "intro": "AMS4 Yuva1 filamenti tükendi. Eski filament temizlenirken lütfen bekleyin."
        },
        {
            "ecode": "1201320000010001",
            "intro": "AMS2 Yuva3 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        },
        {
            "ecode": "1200210000020003",
            "intro": "AMS1 Yuva2 filamenti PTFE tüpünde kırılmış olabilir."
        },
        {
            "ecode": "0703220000030002",
            "intro": "AMS4 Yuva3 filamenti tükendi ve otomatik olarak aynı filamente sahip yuvaya geçti."
        },
        {
            "ecode": "0701210000020005",
            "intro": "AMS2 Yuva2 filamenti bitti ve eski filamentin temizlenmesi düzgün olmayan şekilde gerçekleşti; lütfen filamentin takım kafasında sıkışıp sıkışmadığını kontrol edin."
        },
        {
            "ecode": "1203120000020002",
            "intro": "AMS4 Yuva3 motoru aşırı yüklenmiş. Filament karışmış veya sıkışmış olabilir."
        },
        {
            "ecode": "0700310000010004",
            "intro": "Şifreleme çipi arızası."
        },
        {
            "ecode": "0C00010000020007",
            "intro": "Mikro Lidar lazer parametreleri sapmış. Lütfen yazıcınızı yeniden kalibre edin."
        },
        {
            "ecode": "0C00030000030008",
            "intro": "Olası spagetti hataları tespit edildi. Lütfen baskı kalitesini kontrol edin ve işin durdurulup durdurulmayacağına karar verin."
        },
        {
            "ecode": "0C0001000001000A",
            "intro": "Mikro Lidar LED'i kırılmış olabilir."
        },
        {
            "ecode": "0300920000010006",
            "intro": "Hazne ısıtıcı 2'in sıcaklığı düzgün değil. Sensörde kısa devre olabilir."
        },
        {
            "ecode": "0700450000020001",
            "intro": "Filament kesici sensörü arızalı; lütfen konektörün düzgün takılıp takılmadığını kontrol edin."
        },
        {
            "ecode": "0703300000030003",
            "intro": "RFID, donanımsal veya yapısal bir hata nedeniyle okunamıyor."
        },
        {
            "ecode": "0703200000020001",
            "intro": "AMS4 Yuva1 filamenti tükendi. Lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "0701010000010003",
            "intro": "AMS2 yardımcı motor tork kontrolü arızalı. Akım sensörü arızalı olabilir."
        },
        {
            "ecode": "1203710000010001",
            "intro": "AMS4 Filament hızı ve uzunluğu hatası: Yuva 2 filament odometrisi hatalı olabilir."
        },
        {
            "ecode": "1201230000020002",
            "intro": "AMS2 Yuva4 boş; lütfen yeni bir filament yerleştirin."
        },
        {
            "ecode": "1202300000010001",
            "intro": "AMS3 Yuva1 RFID bobini bozuk veya RF donanım devresinde bir hata var."
        }
    ],
    "ver": 202406200846
}